[
  {
    "name": "From",
    "episode": "Revelations, chapter two",
    "description": "Kausi päättyy. Boyd on viritetty äärirajoilleen, sillä yhden hänelle rakkaan ihmisen aika alkaa loppua. Trauma piinaa Randallia, ja Victor saa selville karun totuuden. Matthewsin perhe on automatkalla jossain keskellä Yhdysvaltoja, kun he jäävät jumiin mystiseen pikkukaupunkiin. Eikä ihan tavalliseen sellaiseen: kylää piinavat joka ilta vaaralliset olennot. Sarjan taustalta löytyvät suositun Lost-sarjan tuottajat. Aisteja järkyttävä sarja kerännyt kehuja muun muassa kauhun kuninkaalta, Stephen Kingiltä. S03E10",
    "start": 29430565,
    "stop": 29430625,
    "series_id": 0,
    "id": 77720863,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Murha Sandhamnissa",
    "episode": "Lili, osa 1",
    "description": "Ruotsin tunnetuin golffari Teo Skog ilmoittaa vaimonsa kadonneen. Stenmark priorisoi jutun, mutta voiko Teo tietää enemmän kuin kertoo? Tukholman saaristo ei ole niin rauhallinen kuin luulit. Aaltojen lyödessä kallioita vasten rikostarkastaja syyttäjä Nora Linde taistelee arvaamatonta pahuutta vastaan. S08E03",
    "start": 29430625,
    "stop": 29430670,
    "series_id": 9002,
    "id": 77720864,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Murha Sandhamnissa",
    "episode": "Lili, osa 2",
    "description": "Stenmarkia harmittaa, ettei Teoa jätetä rauhaan, mutta todistajanlausunnot ovat ristiriitaisia. Lili osoittautuu Noran perhetutuksi. Tukholman saaristo ei ole niin rauhallinen kuin luulit. Aaltojen lyödessä kallioita vasten rikostarkastaja syyttäjä Nora Linde taistelee arvaamatonta pahuutta vastaan. S08E04",
    "start": 29430670,
    "stop": 29430715,
    "series_id": 9002,
    "id": 77720865,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Agatha Christien Hjerson",
    "episode": "Sarja alkaa",
    "description": "Tunnettu murhatutkija on matkalla Ahvenanmaalle, kun lautan hytistä löytyy murhattu toimittaja. Kannoilleen tutkija saa tv-tuottajan. Moderni ruotsalainen arvoitusdekkari, jonka innoittajina olivat Agatha Christien kertomukset. Ainutlaatuinen murhatutkija Sven Hjerson (Johan Rheborg) muodostaa yllättävän etsiväkaksikon omapäisen tv-tuottajan (Hanna Alström) kanssa. S01E01",
    "start": 29430715,
    "stop": 29430760,
    "series_id": 14700,
    "id": 77720866,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Agatha Christien Hjerson",
    "episode": "",
    "description": "Magnuksen löytyminen kuolleena muuttaa tilannetta. .Epäilykset muita epäiltyjä kohtaan vahvistuvat. Pian saavutaan Maarianhaminaan ja aika loppuu. Moderni ruotsalainen arvoitusdekkari, jonka innoittajina olivat Agatha Christien kertomukset. Ainutlaatuinen murhatutkija Sven Hjerson (Johan Rheborg) muodostaa yllättävän etsiväkaksikon omapäisen tv-tuottajan (Hanna Alström) kanssa. S01E02",
    "start": 29430760,
    "stop": 29430805,
    "series_id": 14700,
    "id": 77720867,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Sokaistuneet",
    "episode": "",
    "description": "Maltassa Bea ja Peder antavat suhteelleen uuden mahdollisuuden, mutta ilta päättyy kyyneliin. .Tukholmassa Pierre Eckervik yrittää välttää katastrofin. Carolina Neurathin todellisuuden innoittamaan romaaniin perustuva jännitysdraama nuoresta toimittajasta, joka ajautuu keskelle valtapelien, rahan ja salaisuuksien maailmaa. Tiivistunnelmaisen sarjan tähtinä Julia Ragnarsson ja Matias Varela. S02E05",
    "start": 29430805,
    "stop": 29430850,
    "series_id": 13725,
    "id": 77720868,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Sokaistuneet",
    "episode": "",
    "description": "Dagbladet on pulassa, ja Rapp uhrautuu itse pelastaakseen lehden. .Peder antaa tunteiden ohjata ja auttaa Bean ulos vankilasta. Bea palaa Tukholmaan. Carolina Neurathin todellisuuden innoittamaan romaaniin perustuva jännitysdraama nuoresta toimittajasta, joka ajautuu keskelle valtapelien, rahan ja salaisuuksien maailmaa. Tiivistunnelmaisen sarjan tähtinä Julia Ragnarsson ja Matias Varela. S02E06",
    "start": 29430850,
    "stop": 29430895,
    "series_id": 13725,
    "id": 77723868,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "On Set",
    "episode": "",
    "description": "Kausi 1, jakso 19/65. Viihdeohjelma On Set vie Hollywoodin tähtitehtaan kulissien taakse.",
    "start": 29430895,
    "stop": 29430920,
    "series_id": 15234,
    "id": 77723869,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Star File",
    "episode": "Martin Scorsese",
    "description": "Viihdeohjelma, jonka jokaisessa osassa piirretään muotokuva jostakin Hollywood-tähdestä, alkutaipaleelta uran huipuille ja suvantoihin. S01E55",
    "start": 29430920,
    "stop": 29430930,
    "series_id": 14513,
    "id": 77723870,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Star File",
    "episode": "Robert Downey Jr",
    "description": "Viihdeohjelma, jonka jokaisessa osassa piirretään muotokuva jostakin Hollywood-tähdestä, alkutaipaleelta uran huipuille ja suvantoihin. S01E71",
    "start": 29430930,
    "stop": 29430940,
    "series_id": 14513,
    "id": 77723871,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Bambi - tarina metsän elämästä",
    "episode": "",
    "description": "Tapaa ihastuttava Bambi ja tämän ystävät korppi, kani ja pesukarhu hurmaavassa koko perheen elokuvassa, jossa rakastettu tarina kerrotaan uudella tavalla, autenttisen luontokuvituksen siivittämänä. Bambi - tarina metsän elämästä pohjautuu Felix Saltenin klassikkoteokseen äitinsä menettävän metsäkauriin seikkailuista. Ohjaus: Michel Fessler. (Bambi - l'histoire d'une vie dans les bois, France, 2024)",
    "start": 29430940,
    "stop": 29431015,
    "series_id": 31,
    "id": 77723872,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Holiday",
    "episode": "",
    "description": "Cameron Diazin ja Kate Winsletin tähdittämä romanttinen hittikomedia, jossa Iris ja Amanda vaihtavat kahdeksi viikoksi kotia – talo Kaliforniassa vaihtuu englantilaiseen mökkiin ja toisin päin. Kotien vaihtamisella on yllättäviä ja romanttisia seurauksia molempien naisten elämään. Pääosissa: Cameron Diaz, Kate Winslet, Jude Law, Jack Black, Eli Wallach. Ohjaus: Nancy Meyers. (The Holiday, United States, 2006)",
    "start": 29431015,
    "stop": 29431145,
    "series_id": 0,
    "id": 77723873,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Dinner Rush",
    "episode": "",
    "description": "New Yorkin trendikkäällä Tribecan alueella toimii italialainen ravintola Gigino. Omistaja Louis on tyytymätön siihen, miten hänen poikansa, tähtikokki Udo, on muuttanut perheravintolan trendipaikaksi. Udo kilpailee yhdestä tarjoilijattarista apukokin kanssa, ja tällä on lisäksi ravintolassa vieraina olevat koronkiskurit niskassaan. Pääosissa: Danny Aiello, Edoardo Ballerini, Vivian Wu, Summer Phoenix, Jamie Harris. Ohjaus: Bob Giraldi. (United States, 2000)",
    "start": 29431145,
    "stop": 29431240,
    "series_id": 0,
    "id": 77723874,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Mother's Day",
    "episode": "",
    "description": "Tähdillä roolitettu amerikkalainen draamakomedia, jossa kuvataan äitiyden ilmiötä erilaisten naisten näkökulmasta äitienpäivän yhteydessä. Pääosissa: Jennifer Aniston, Kate Hudson, Julia Roberts, Jason Sudeikis. Ohjaus: Garry Marshall. (United States, 2016)",
    "start": 29431240,
    "stop": 29431355,
    "series_id": 0,
    "id": 77723875,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Happy fucking Pride",
    "episode": "“Fuck the Pain Away”",
    "description": "On viikon kohokohdan, kaikkien aikojen bileiden aika! Dilan haluaa jäädä kotiin, mutta hänet suostutellaan mukaan. Ninan ja Saschan suhde jännittyy. Tukholma kuplii odotuksia Pride-viikon alkaessa. Treffejä odottava pikkukaupungin poika Dilan, näennäisen itsevarma mutta satutettu huippumeklari Ari ja tämän juuri jätetty kaveri Nina navigoivat vauhdikkaiden kesäpäivien ja kuumien kesäöiden läpi. S01E05",
    "start": 29431355,
    "stop": 29431375,
    "series_id": 0,
    "id": 77723876,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Happy fucking Pride",
    "episode": "“Birds of Paradise”",
    "description": "Kausi päättyy. Huuman laannuttua iskee todellisuus. Dilan lähtee juhlista yksin mutta kohtaa pian jotain häijyä. Nina tekee suuren päätöksen. Tukholma kuplii odotuksia Pride-viikon alkaessa. Treffejä odottava pikkukaupungin poika Dilan, näennäisen itsevarma mutta satutettu huippumeklari Ari ja tämän juuri jätetty kaveri Nina navigoivat vauhdikkaiden kesäpäivien ja kuumien kesäöiden läpi. S01E06",
    "start": 29431375,
    "stop": 29431395,
    "series_id": 0,
    "id": 77723877,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Pidätä henkeä!",
    "episode": "Ajattelet vain itseäsi!",
    "description": "Wilma on saanut tarpeekseen joukkueestaan ja saaresta ja yrittää paeta kanoottiretken aikana. Konflikti riistäytyy käsistä, ja pian ollaan eksyksissä. Ruotsalaisessa nuorisosarjassa seuraamme kolmea teiniä, jotka tulevat aivan eri maailmoista ja tapaavat tapahtumarikkaalla kesäleirillä. S01E04",
    "start": 29431395,
    "stop": 29431410,
    "series_id": 14885,
    "id": 77723878,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Pidätä henkeä!",
    "episode": "Totuus vai tehtävä?",
    "description": "Wilman pakosuunnitelma jatkuu joukkueen joutuessa rangaistuksena saarelle yksin. Soitettuaan taksiveneen hän löytää viinapullon ja joutuu leikkiin. Ruotsalaisessa nuorisosarjassa seuraamme kolmea teiniä, jotka tulevat aivan eri maailmoista ja tapaavat tapahtumarikkaalla kesäleirillä. S01E05",
    "start": 29431410,
    "stop": 29431425,
    "series_id": 14885,
    "id": 77723879,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Pidätä henkeä!",
    "episode": "Parasta lääkettä!",
    "description": "Edellisillan kännin jälkeen joukkue yrittää koota itsensä. Lo, Ruben ja Wilma suutelivat eivätkä tiedä nyt, miten käsitellä tilannetta. Ruotsalaisessa nuorisosarjassa seuraamme kolmea teiniä, jotka tulevat aivan eri maailmoista ja tapaavat tapahtumarikkaalla kesäleirillä. S01E06",
    "start": 29431425,
    "stop": 29431440,
    "series_id": 14885,
    "id": 77723880,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Ronja Ryövärintytär",
    "episode": "Ikuinen riita - osa 1",
    "description": "Myrskyisenä yönä ukkosen pauhatessa ja ajattarien kirkuessa salama iskee Matiaksenlinnaan ja halkaisee sen kahtia. Samana yönä syntyy ryöväriruhtinas Matiakselle tytär, joka saa nimen Ronja. Tyttö kasvaa Matiaksen, Loviisan ja ryövärijoukkion valvovien silmien alla. Kun Ronja on tarpeeksi vanha, hän saa luvan lähteä itsekseen tutkimaan ympäröivää metsää. S01E15",
    "start": 29431440,
    "stop": 29431465,
    "series_id": 0,
    "id": 77723881,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Ronja Ryövärintytär",
    "episode": "Ikuinen riita - osa 2",
    "description": "Myrskyisenä yönä ukkosen pauhatessa ja ajattarien kirkuessa salama iskee Matiaksenlinnaan ja halkaisee sen kahtia. Samana yönä syntyy ryöväriruhtinas Matiakselle tytär, joka saa nimen Ronja. Tyttö kasvaa Matiaksen, Loviisan ja ryövärijoukkion valvovien silmien alla. Kun Ronja on tarpeeksi vanha, hän saa luvan lähteä itsekseen tutkimaan ympäröivää metsää. S01E16",
    "start": 29431465,
    "stop": 29431490,
    "series_id": 0,
    "id": 77723882,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Solsidan - onnea onkimassa",
    "episode": "",
    "description": "Alex joutuu mukaan Wilman luokkaretkelle viikinkikylään. .Mickan kuulee ADHD-trendistä ja menee tutkimuksiin. Fredde ja Viktor käyvät mobiilisotaa. Alex ja Anna ovat juuri muuttaneet Alexin lapsuudenkotiin Saltsjöbadeniin Tuhkolman ulkopuolelle. Alex koittaa kaikkensa, jotta Anna viihtyisi uudessa porvarillisessa ympäristössä. Alexin vanha ystävä Fredde asuu vaimonsa ja lastensa kanssa naapurissa. Tämä nelikko koittaa selviytyä elämän haasteista. Ruotsalainen komediasarja. S06E09",
    "start": 29431490,
    "stop": 29431515,
    "series_id": 10455,
    "id": 77723883,
    "agelimit": 0,
    "channel": 17,
    "rating": 45
  },
  {
    "name": "Solsidan - onnea onkimassa",
    "episode": "Kausi päättyy",
    "description": "Alex yrittää päästä pokeri-illasta Oven luona. Fredde voisi testata grillituotteita Ericille, mutta Mickanin suhde Suzyyn on ongelma. Alex ja Anna ovat juuri muuttaneet Alexin lapsuudenkotiin Saltsjöbadeniin Tuhkolman ulkopuolelle. Alex koittaa kaikkensa, jotta Anna viihtyisi uudessa porvarillisessa ympäristössä. Alexin vanha ystävä Fredde asuu vaimonsa ja lastensa kanssa naapurissa. Tämä nelikko koittaa selviytyä elämän haasteista. Ruotsalainen komediasarja. S06E10",
    "start": 29431515,
    "stop": 29431535,
    "series_id": 10455,
    "id": 77723884,
    "agelimit": 0,
    "channel": 17,
    "rating": 45
  },
  {
    "name": "Tervetuloa Sjölyckaniin!",
    "episode": "Veli Pystyvä",
    "description": "Söderbergin poika tulee Sjölyckaniin. Hänestä tulee pian Berndtin suosikki ja Tomasin ja Klaran yhteinen vihollinen. Rille vaarantaa avioliittonsa. Ruotsalainen komediasarja, johon on helppo samastua. Millaisia ongelmia voi syntyä, kun kolme sukupolvea kokoontuu kesäpaikkaan saaristoon? S02E03",
    "start": 29431535,
    "stop": 29431560,
    "series_id": 15865,
    "id": 77723885,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Tervetuloa Sjölyckaniin!",
    "episode": "Sjölyckanin hamstraaja",
    "description": "Tomas yrittää siivota liikavarastoja mutta saa vastaansa Klaran. Lilyä raivostuttaa Klingien tapa laittaa juustohöylä jääkaappiin tiskikoneen sijaan. Ruotsalainen komediasarja, johon on helppo samastua. Millaisia ongelmia voi syntyä, kun kolme sukupolvea kokoontuu kesäpaikkaan saaristoon? S02E04",
    "start": 29431560,
    "stop": 29431585,
    "series_id": 15865,
    "id": 77723886,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Lajka",
    "episode": "",
    "description": "Rut osallistuu kiusaamisen vastaiseen kampanjaan. .Hän haluaa kertoa tarinansa ja totuuden työstään, mutta kohtaa vastarintaa. Cajsa saa tarjouksen. Felicia Danielssonin ja Vera Herngrenin satiirisarja. Saamme seurata ystävysten Rutin ja Cajsan päivittäisiä haasteita influencer-maailmassa. S01E05",
    "start": 29431585,
    "stop": 29431605,
    "series_id": 15868,
    "id": 77723887,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Lajka",
    "episode": "",
    "description": "Cajsan totuus Rutin toimistosta ja pomoista saa aikaan otsikoita somessa, ja koko henkilöstö kutsutaan kuulusteluun. .Rut näkee kaaoksessa tilaisuuden. Felicia Danielssonin ja Vera Herngrenin satiirisarja. Saamme seurata ystävysten Rutin ja Cajsan päivittäisiä haasteita influencer-maailmassa. S01E06",
    "start": 29431605,
    "stop": 29431625,
    "series_id": 15868,
    "id": 77723888,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Padelunelmia",
    "episode": "",
    "description": "Hasse haluaa valmistautua padelmessuihin, mutta saako hän Fabianin mukaan? .Fabian on nimittäin rakastunut ja keskittyy nyt vain Lindaan. Ruotsalainen komediasarja Fabianista ja Hassesta, jotka päättävät muuttaa sulkkishallinsa padelhalliksi. Vaikkei heillä ole hajuakaan koko hommasta, he satsaavat projektiin lapsen innolla ja täynnä tulevaisuudenuskoa. S01E05",
    "start": 29431625,
    "stop": 29431650,
    "series_id": 15869,
    "id": 77723889,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Padelunelmia",
    "episode": "Kausi päättyy",
    "description": "Fabian käy dramaattisilla treffeillä Lindan kanssa ja joutuu myös välittämään Lindan vankilassa aloittamassa panttivankidraamassa. Ruotsalainen komediasarja Fabianista ja Hassesta, jotka päättävät muuttaa sulkkishallinsa padelhalliksi. Vaikkei heillä ole hajuakaan koko hommasta, he satsaavat projektiin lapsen innolla ja täynnä tulevaisuudenuskoa. S01E06",
    "start": 29431650,
    "stop": 29431675,
    "series_id": 15869,
    "id": 77723890,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Totte Svensson ja nuoruuden lähteen metsästys",
    "episode": "",
    "description": "Haluttu kirja on nyt italialaisen mafiapomon käsissä. .Joanna Silver yrittää ostaa sen, mutta Tottella on turvajärjestelmän aukkoon perustuva idea. Mestarietsivä Totte Svensson saa yhteydenoton sisaruksilta, joiden vanhemmat on siepattu. Voiko Jeppe Kärppä olla taas vauhdissa? S02E05",
    "start": 29431675,
    "stop": 29431700,
    "series_id": 0,
    "id": 77723891,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Totte Svensson ja nuoruuden lähteen metsästys",
    "episode": "",
    "description": "Totte ja lapset palaavat kotiin. .Totte miettii, suostuako Silverin vaatimukseen. Tämähän tekee yhteistyötä maailmanherruuteen pyrkivän Kärpän kanssa. Mestarietsivä Totte Svensson saa yhteydenoton sisaruksilta, joiden vanhemmat on siepattu. Voiko Jeppe Kärppä olla taas vauhdissa? S02E06",
    "start": 29431700,
    "stop": 29431725,
    "series_id": 0,
    "id": 77723892,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Lasse-Maijan etsivätoimisto",
    "episode": "Etsivämysteeri",
    "description": "Vallilassa tapahtuu useita mystisiä murtoja, ja tähtietsivä Torkel Nööt ilmestyy paikalle ratkaisemaan jutun. Poliisimestari sokaistuu tämän työstä. Koko perheen sarja perustuu Martin Widmarkin ja Helena Willisin rakastettuihin kirjoihin. Anders Jansson esittää Vallilan lahjatonta poliisimestaria. S02E03",
    "start": 29431725,
    "stop": 29431770,
    "series_id": 14521,
    "id": 77723893,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Aallonmurtaja",
    "episode": "Vaarallinen vieras",
    "description": "Tuula uhraa paljon saadakseen oikeutta. Jengien välit ovat veitsenterällä ja 77:n Jokke pilkkaa Upia. Järvinen saa tilaisuutensa. Nuppu lähentyy Lukea ja Inari löytää vaarallisen kätkön. S03E03",
    "start": 29431770,
    "stop": 29431815,
    "series_id": 14252,
    "id": 77723894,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Kämppikset",
    "episode": "",
    "description": "Lääketieteen ja rakkauden parantama. .Jessen kutsumus hoitoalalle herää, Pilvin muistolaatikko saa hänet haaveilemaan matkasta kaukomaille, Raimo palaa kotiin ja tonttu saa vihdoin nimen. Hulvattomassa MTV-alkuperäissarjassa seitsemänkymppiset seniorit ja teini-ikäiset juniorit muuttavat kimppakämppään ja elävät yhdessä kuin viimeistä päivää. S02E10",
    "start": 29431815,
    "stop": 29431860,
    "series_id": 15068,
    "id": 77723895,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Kunnes kuolema meidät erottaa",
    "episode": "Otsasuudelmia ja piiskaa",
    "description": "Sarja alkaa.  Väljähtäneen avioliittonsa ja vauva-arjen uuvuttama Beta odottaa lapselleen päiväkotipaikkaa palatakseen töihin. Hän hyväksyy pitkin hampain äitinsä tarjouksen ja palkkaa parikymppisen Atlin lapsenhoitajaksi. S01E01",
    "start": 29431860,
    "stop": 29431900,
    "series_id": 14005,
    "id": 77723896,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Kunnes kuolema meidät erottaa",
    "episode": "Kaikki peliin",
    "description": "Thomas ja Beta saavat palautettua kipinän suhteeseensa, mutta illallinen Thomasin epämääräisten liikekumppanien kanssa tuo takapakkia. Pari kääntyy uudestaan Atlin puoleen. Kuusiosainen islantilainen draamasarja kertoo Betasta, vauva-arjen uuvuttamasta säveltäjästä, joka kaipaa entistä elämäänsä. Piristystä arkeen tulee yllättävältä taholta, kun parikymppinen melkein serkku Atli muuttaa Betan ja tämän aviomiehen kotiin lapsenhoitajaksi. Atli tutustuttaa heidät parisuhdepelien ja viettelytehtävien maailmaan, mutta voiko avioliittoa enää pelastaa? S01E02",
    "start": 29431900,
    "stop": 29431945,
    "series_id": 14005,
    "id": 77723897,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Top Dog",
    "episode": "Kausi alkaa",
    "description": "Teddy ja Emily tapailevat salaa. Teddy ja Isak yrittävät perustaa vakavasti otettavaa yritystä, kun taas Emily hakee uutta työpaikkaa. Erittäin epäsopiva pari - juristi Emily (Josefin Asplund) ja ex-rikollinen Teddy (Alexej Manvelov) - tulevat yhteen jahdatessaan kidnappaajaa. Ruotsalainen trillerisarja perustuu Jens Lapiduksen menestyneeseen kirjatrilogiaan. S02E01",
    "start": 29431945,
    "stop": 29431985,
    "series_id": 6657,
    "id": 77723898,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Top Dog",
    "episode": "Emilyn on valittava uran ja rakkauden välillä",
    "description": ".Teddy miettii, onko Emily vain käyttänyt häntä hyväkseen. Alueen uusi rikollisjengi provosoi Teddyä. Erittäin epäsopiva pari - juristi Emily (Josefin Asplund) ja ex-rikollinen Teddy (Alexej Manvelov) - tulevat yhteen jahdatessaan kidnappaajaa. Ruotsalainen trillerisarja perustuu Jens Lapiduksen menestyneeseen kirjatrilogiaan. S02E02",
    "start": 29431985,
    "stop": 29432030,
    "series_id": 6657,
    "id": 77723899,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Murha Sandhamnissa",
    "episode": "Olivia, osa 1",
    "description": "Kaksi nuorta karkaa retken aikana. Sebbe varastaa veneen, ja hänen ystävänsä Olivian oletetaan olevan mukana. Mutta Olivia onkin pois. Tukholman saaristo ei ole niin rauhallinen kuin luulit. Aaltojen lyödessä kallioita vasten rikostarkastaja syyttäjä Nora Linde taistelee arvaamatonta pahuutta vastaan. S08E05",
    "start": 29432030,
    "stop": 29432075,
    "series_id": 9002,
    "id": 77723900,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Murha Sandhamnissa",
    "episode": "Kausi päättyy",
    "description": "Olivia, osa 2. Nathalie yrittää epätoivoisesti tulla otetuksi vakavasti. Alexander kuulee uutisen ja reagoi kuuntelematta määräyksiä. Tukholman saaristo ei ole niin rauhallinen kuin luulit. Aaltojen lyödessä kallioita vasten rikostarkastaja syyttäjä Nora Linde taistelee arvaamatonta pahuutta vastaan. S08E06",
    "start": 29432075,
    "stop": 29432120,
    "series_id": 9002,
    "id": 77723901,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Agatha Christien Hjerson",
    "episode": "",
    "description": "Pahoinpidelty mies kanapuvussa katoaa rannalta. .Klara tulee auttamaan, löytääkseen samalla ehkä skuupin. Hjersonin vanhat muistot heräävät eloon. Moderni ruotsalainen arvoitusdekkari, jonka innoittajina olivat Agatha Christien kertomukset. Ainutlaatuinen murhatutkija Sven Hjerson (Johan Rheborg) muodostaa yllättävän etsiväkaksikon omapäisen tv-tuottajan (Hanna Alström) kanssa. S01E03",
    "start": 29432120,
    "stop": 29432165,
    "series_id": 14700,
    "id": 77723902,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Agatha Christien Hjerson",
    "episode": "",
    "description": "Hjersonin ampumisen jälkeen syyllisen jahti kiihtyy. .Åkermanin perheen kulissi alkaa rakoilla. Tapauksesta tulee Hjersonille hyvin henkilökohtainen. Moderni ruotsalainen arvoitusdekkari, jonka innoittajina olivat Agatha Christien kertomukset. Ainutlaatuinen murhatutkija Sven Hjerson (Johan Rheborg) muodostaa yllättävän etsiväkaksikon omapäisen tv-tuottajan (Hanna Alström) kanssa. S01E04",
    "start": 29432165,
    "stop": 29432210,
    "series_id": 14700,
    "id": 77723903,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Sokaistuneet",
    "episode": "",
    "description": "Bea jahtaa Thulinia, kun hän saa järkyttävän uutisen. .Eckervik on päättänyt myydä Easyn suunnitellusti ja tekee kaikkensa siivotakseen jälkensä. Carolina Neurathin todellisuuden innoittamaan romaaniin perustuva jännitysdraama nuoresta toimittajasta, joka ajautuu keskelle valtapelien, rahan ja salaisuuksien maailmaa. Tiivistunnelmaisen sarjan tähtinä Julia Ragnarsson ja Matias Varela. S02E07",
    "start": 29432210,
    "stop": 29432255,
    "series_id": 13725,
    "id": 77723904,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Sokaistuneet",
    "episode": "Kausi päättyy",
    "description": "Bea on epätoivoinen, uhkaa Ygreniä ja murtautuu Susannen kotiin selvittääkseen, mihin Thulin on lähtenyt. Pederillä on huono omatunto. Carolina Neurathin todellisuuden innoittamaan romaaniin perustuva jännitysdraama nuoresta toimittajasta, joka ajautuu keskelle valtapelien, rahan ja salaisuuksien maailmaa. Tiivistunnelmaisen sarjan tähtinä Julia Ragnarsson ja Matias Varela. S02E08",
    "start": 29432255,
    "stop": 29432300,
    "series_id": 13725,
    "id": 77723905,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  },
  {
    "name": "Populäärimusiikkia Vittulajänkältä",
    "episode": "",
    "description": "Reza Bagherin filmatisointi Mikael Niemen kirjasta, joka on villi kasvukertomus, jossa Niila ja Matti oppivat tuntemaan rock'n'rollia ja omaa seksuaalisuuttaan juominkien ja saunomisen välissä 1960-luvun Pajalassa. Pääosissa: Max Enderfors, Andreas af Enehielm, Björn Kjellman. Ohjaus: Reza Bagher. (Populärmusik från Vittula, Ruotsi, 2004)",
    "start": 29432300,
    "stop": 29432400,
    "series_id": 31,
    "id": 77723906,
    "agelimit": 0,
    "channel": 17,
    "rating": 0
  }
]