[
  {
    "name": "The Voyeurs",
    "episode": "",
    "description": "Nuori pariskunta kiinnostuu naapureidensa seksielämästä kadun toisella puolella. Viattomasta uteliaisuudesta kehittyy epäterveellinen pakkomielle, joka johtaa kohtalokkaisiin seurauksiin. Amerikkalainen trilleri vuodelta 2021.",
    "start": 29430600,
    "stop": 29430720,
    "series_id": 31,
    "id": 77721119,
    "agelimit": 18,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "We Live in Time",
    "episode": "",
    "description": "Elämänmakuinen tarina seuraa nosteessa olevaa kokkia, Almutia, ja hiljattain eronnutta Tobiasta, joiden odottamaton kohtaaminen muuttaa heidän elämänsä suunnan. Elokuva kuvaa välähdyksinä Almutin ja Tobiaksen yhteisen elämän merkittävimpiä hetkiä: rakastumista, kodin rakentamista ja perheen perustamista. Brittiläinen draama vuodelta 2024.",
    "start": 29430720,
    "stop": 29430840,
    "series_id": 31,
    "id": 77721120,
    "agelimit": 12,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "The Iron Claw",
    "episode": "",
    "description": "Tositarina erottamattomista Von Erichin veljeksistä, jotka tekivät historiaa showpainin kilpailuhenkisessä maailmassa 1980-luvun alussa. Tragedioita ja voittoja kokevat, dominoivan valmentajaisänsä varjossa elävät veljekset pyrkivät saavuttamaan kuolemattomuuden urheilumaailman suurimmalla areenalla. Amerikkalainen draama vuodelta 2023.",
    "start": 29430840,
    "stop": 29430970,
    "series_id": 31,
    "id": 77725156,
    "agelimit": 15,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "Inheritance",
    "episode": "",
    "description": "Kun Maya saa tietää, että hänen isänsä on entinen vakooja, hän päätyy yhtäkkiä keskelle kansainvälistä salaliittoa. Amerikkalainen trilleri vuodelta 2025.",
    "start": 29430970,
    "stop": 29431064,
    "series_id": 31,
    "id": 77725157,
    "agelimit": 15,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "Strangers by Night",
    "episode": "",
    "description": "Eräänä iltana Pariisin täpötäydessä metrossa Aymeric törmää Nathalieen, kun he molemmat nousevat samaan vaunuun. He riitelevät, joka luo muille matkustajille nautinnollisen katuteatterinäytöksen. Ranskalainen draama vuodelta 2023.",
    "start": 29431080,
    "stop": 29431167,
    "series_id": 31,
    "id": 77725158,
    "agelimit": 12,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "Summer Camp",
    "episode": "",
    "description": "Ginny (Kathy Bates), Nora (Diane Keaton) ja Mary (Alfre Woodard) ovat olleet parhaita ystävyksiä lapsuudesta saakka, viettäen kesät erottamattomina leirillä. 50 vuotta myöhemmin, heidän elämänsä eivät ole sitä, mitä he kuvittelivat, mutta yksi asia on totta: Ginny, Nora ja Mary tarvitsevat toisiaan, ja uudelleennäkeminen kesäleirillä muistuttaa heitä siitä miksi näin on. Amerikkalainen komedia vuodelta 2024.",
    "start": 29431200,
    "stop": 29431300,
    "series_id": 31,
    "id": 77725159,
    "agelimit": 12,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "Origin",
    "episode": "",
    "description": "Hän matkustaa surun ja rakkauden repimänä mantereiden ja vieraiden kulttuurien halki työstäessään menestysteostaan \"Castea\". Isabel Wilkersonin (Aunjanue Ellis-Taylor) sekä ulkoisesti että sisäisesti eeppinen matka on tarina historian arvoituksista, romantiikan ihmeistä ja taistelusta paremman tulevaisuuden puolesta. Origin on kriitikoiden ylistämä draama Ava DuVernaylta (Selma, 13. lisäys), ja sen pääosassa on Oscar-ehdokas Aunjanue Ellis-Taylors (King Richard: Williamsien tarina, Ray) Pulitzer-palkittuna toimittaja Isabel Wilkersonina. Amerikkalainen draama vuodelta 2023.",
    "start": 29431300,
    "stop": 29431440,
    "series_id": 31,
    "id": 77725160,
    "agelimit": 12,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "Two to One",
    "episode": "",
    "description": "Kesä 1990 on historiallista aikaa entisessä Itä-Saksassa. Yhdistyminen Länsi-Saksan kanssa on nurkan takana, ja muutoksen tuulet puhaltavat. Maren (Sandra Hüller) ja hänen perheensä hautovat nerokkaalta vaikuttavan suunnitelman saadakseen haalittua itselleen miljoonia unohdettuja itämarkkoja. Ainoa kysymys kuitenkin on, miten he saavat ne vaihdettua nykyrahaksi herättämättä epäilyksiä. Zwei zu eins on tositarinaan perustuva komedia, jonka pääosassa nähdään Sandra Hüller (Putoamisen anatomia, The Zone of Interest). Saksalainen rikoskomedia vuodelta 2024.",
    "start": 29431440,
    "stop": 29431560,
    "series_id": 31,
    "id": 77725161,
    "agelimit": 15,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "Memory",
    "episode": "",
    "description": "Sylvia (Jessica Chastain) elää yksinkertaista ja rutiininomaista elämää, joka jakautuu tyttären, työn ja AA-kokousten kesken. Lukion luokkakokouksen jälkeen erikoislaatuinen Saul (Peter Sarsgaard) seuraa häntä kotiin, ja heidän yllättävä tapaamisensa avaa ovet sekä menneisyyteen että hyvin erilaiseen tulevaisuuteen. Memory on Michel Francon Kultainen leijona -ehdokkuuden saanut draamaelokuva, jonka pääosissa nähdään Jessica Chastain (Zero Dark Thirty, Molly's Game) ja Peter Sarsgaard (Rautanaamio, Boys Don't Cry). Amerikkalainen draama vuodelta 2023.",
    "start": 29431560,
    "stop": 29431658,
    "series_id": 31,
    "id": 77725162,
    "agelimit": 15,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "Showing Up",
    "episode": "",
    "description": "Uuteen näyttelyynsä valmistautuvan kuvanveistäjän on tasapainoteltava luovan työn, perheen ja ystävien päivittäisten draamojen kanssa Kelly Reichardtin eloisassa ja vangitsevan hauskassa elokuvassa. Amerikkalainen draama vuodelta 2023. (Yhdysvallat, 2022)",
    "start": 29431680,
    "stop": 29431790,
    "series_id": 31,
    "id": 77725163,
    "agelimit": 12,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "Challengers",
    "episode": "",
    "description": "Entinen tennispelaaja Tashi on tehnyt aviomiehestään Artista tenniskyvyn. Nyt Artin ura on laskussa, ja Tashi ilmoittaa hänet Challenger-turnaukseen, jossa Art kohtaa vastustajan, jonka he tuntevat. Amerikkalainen/italialainen draama vuodelta 2024.",
    "start": 29431790,
    "stop": 29431920,
    "series_id": 31,
    "id": 77725164,
    "agelimit": 15,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "Long Gone Heroes",
    "episode": "",
    "description": "Isänmaasta, uskosta ja jopa toivosta luopunut erikoisjoukkojen sotilas joutuu palaamaan taistelukentälle löytääkseen toimittajana toimivan sukulaistyttärensä keskeltä pahasti pieleen mennyttä operaatiota. Amerikkalainen toimintatrilleri vuodelta 2024.",
    "start": 29431920,
    "stop": 29432017,
    "series_id": 31,
    "id": 77725165,
    "agelimit": 15,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "The Royal Hotel",
    "episode": "",
    "description": "Amerikkalaiset Hanna (Julia Garner) ja Liv (Jessica Henwick) ovat parhaat ystävykset, jotka ovat reppureissulla Australiassa. Kun rahat loppuvat kesken, seikkailunhaluinen Liv suostuttelee Hannan ottamaan majapaikan sisältävän osa-aikaisen työn “The Royal Hotel” -nimisen pubin baaritiskin takaa syrjäisestä kaivoskaupungista Australian takamailta. Australialainen trilleri vuodelta 2023.",
    "start": 29432040,
    "stop": 29432127,
    "series_id": 31,
    "id": 77725166,
    "agelimit": 18,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "I.S.S. Kansainvälinen avaruusasema",
    "episode": "",
    "description": "Jännitteet leimahtavat lähitulevaisuudessa Kansainvälisellä avaruusasemalla (I.S.S.), kun Maassa puhkeaa maailmanlaajuinen konflikti. Avaruusasemalla olevat yhdysvaltalaiset ja venäläiset astronautit saavat maan päältä käskyn ottaa asema haltuunsa keinolla millä hyvänsä. Ohjaaja Gabriela Cowperthwaite kokoaa yhteen upean näyttelijäkaartin, johon kuuluu muun muassa Oscar®-voittaja Ariana DeBose, tässä korkeiden panosten avaruustrillerissä. Amerikkalainen scifi-toimintaelokuva vuodelta 2023.",
    "start": 29432160,
    "stop": 29432255,
    "series_id": 31,
    "id": 77725167,
    "agelimit": 15,
    "channel": 33,
    "rating": 0
  },
  {
    "name": "The Voyeurs",
    "episode": "",
    "description": "Nuori pariskunta kiinnostuu naapureidensa seksielämästä kadun toisella puolella. Viattomasta uteliaisuudesta kehittyy epäterveellinen pakkomielle, joka johtaa kohtalokkaisiin seurauksiin. Amerikkalainen trilleri vuodelta 2021.",
    "start": 29432280,
    "stop": 29432400,
    "series_id": 31,
    "id": 77725168,
    "agelimit": 18,
    "channel": 33,
    "rating": 0
  }
]