[
  {
    "name": "Vanquish",
    "episode": "",
    "description": "Damon Hickey (Morgan Freeman), eläkkeellä oleva komisario, sieppaa hoitajansa Victorian (Ruby Rose) tyttären ja kiristää näin naisen auttamaan kavaltamaan hänen rikolliset työtoverinsa ja puhdistamaan kaupungin ennen kuin on liian myöhäistä. Järkyttyneenä ainoan tuntemansa luotettavan miehen petoksesta Victoria taistelee tiensä läpi huumekauppiaiden ja alamaailman roistojen lauman pelastaakseen tyttärensä. Amerikkalainen toiminta vuodelta 2021.",
    "start": 29430540,
    "stop": 29430640,
    "series_id": 31,
    "id": 77721142,
    "agelimit": 15,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "Greenland",
    "episode": "",
    "description": "Valtava maata lähestyvä komeetta ajaa Garrityn perheen kamppailuun elämästä ja kuolemasta. John, hänen vaimonsa Allison sekä heidän poikansa Nathan lähtevät vaaralliselle matkalle samalla, kun he joutuvat taistelemaan ympärillään kasvavaa paniikkia ja sekasortoa vastaan. Lähtölaskenta maailmanlaajuista tuhoa vastaan on alkanut, ja on vain yksi turvallinen paikka, jonne paeta… Amerikkalainen toiminta vuodelta 2020.",
    "start": 29430640,
    "stop": 29430759,
    "series_id": 31,
    "id": 77721143,
    "agelimit": 15,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "The Big White",
    "episode": "",
    "description": "Matkatoimistovirkailija Paul Barnell on korviaan myöten veloissa, eikä vakuutusyhtiö suostu pulittamaan Raymond-veljen miljoonan dollarin henkivakuutuskorvausta, vaikka tämä on ollut kateissa jo viisi vuotta. Kaiken lisäksi Paulin vaimolla Margaretilla on Touretten syndrooma. Eräänä päivänä Paul löytää roskalaatikosta tuntemattoman miehen ruumiin ja väittää miestä veljekseen. Tiukkapipoista vakuutustarkastajaa Tediä ei kuitenkaan niin vain huijata. Amerikkalainen draama vuodelta 2005.",
    "start": 29430780,
    "stop": 29430900,
    "series_id": 31,
    "id": 77721144,
    "agelimit": 15,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "Pako viidakkoon",
    "episode": "",
    "description": "The Rockin esittämä palkkionmetsästäjä lähtee etsimään pomonsa hölösuista poikaa, joka katosi olleessaan Amazonin alueella aarrejahdissa. Edessä on todella tukalat paikat. Amerikkalainen toiminta vuodelta 2003.",
    "start": 29430900,
    "stop": 29431000,
    "series_id": 31,
    "id": 77725204,
    "agelimit": 15,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "Searching",
    "episode": "",
    "description": "Kun Davidin tytär katoaa ja poliisi ei onnistu löytämään minkäänlaisia johtolankoja, ottaa hän asiat omiin käsiinsä ja alkaa etsiä salaisuuksia sieltä mistä niitä löytyy: tietokoneelta. Venäläis-amerikkalainen trilleri vuodelta 2018.",
    "start": 29431020,
    "stop": 29431118,
    "series_id": 31,
    "id": 77725205,
    "agelimit": 12,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "Kunnian miehiä",
    "episode": "",
    "description": "Amerikkalaisessa laivastotukikohdassa sattuu epäilyttävä kuolemantapaus – sotamies Santiago kuolee mitä ilmeisemmän simputusteon uhrina. Päämaja alkaa tutkia tapausta ja kaksi merisotilasta saa murhasyytteen. Tapaus haluttaisiin kuitenkin haudata kaikessa hiljaisuudessa. Nuori lakimies Danny Kaffee, joka aina on hoitanut oikeusjuttunsa sopimalla, saa ryhtyä miesten puolustajaksi. Amerikkalainen draama vuodelta 1992.",
    "start": 29431140,
    "stop": 29431272,
    "series_id": 31,
    "id": 77725206,
    "agelimit": 15,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "Kolmetoista päivää",
    "episode": "",
    "description": "Lokakuussa 1962 amerikkalaiset vakoilukoneet ottivat kuvia, joissa näkyi, miten Neuvostoliitto suunnitteli ydinohjusten sijoittamista Kuubaan. Ohjukset olisivat voineet pyyhkäistä Yhdysvaltain kaakkoisrannikon kartalta viidessä minuutissa laukaisusta. Presidentti John F. Kennedy neuvonantajineen alkoi miettiä keinoja neuvostojoukkojen uhkaa vastaan. Hän tahtoi osoittaa voimansa, ja Pentagon neuvoi asevoimia hyökkäämään Kuubaan ja mahdollisesti valtaamaan saaren. Kennedy ei kuitenkaan halunnut ryhtyä moiseen, sillä Neuvostoliitto olisi voinut kostaa hyökkäämällä USA:n Euroopan-liittolaisten kimppuun. Ydinsota alkoi vaikuttaa lähes väistämättömältä. Amerikkalainen draama vuodelta 2000.",
    "start": 29431320,
    "stop": 29431470,
    "series_id": 31,
    "id": 77725207,
    "agelimit": 12,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "I, Tonya",
    "episode": "",
    "description": "Tarina pohjaa kaikkien aikojen Olympia-skandaaliin. Rakastettu taitoluistelija Tonya Hardingin ex-mies suunnittelee Tonyan kilpakumppanin jalkojen murtamista. Miten paljon Tonya tiesi suunnitelmasta? Amerikkalainen draamakomedia vuodelta 2017. (Yhdysvallat, 2018)",
    "start": 29431470,
    "stop": 29431595,
    "series_id": 31,
    "id": 77725208,
    "agelimit": 15,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "Lumikki ja Metsästäjä",
    "episode": "",
    "description": "Lumikin kauneus on uhka maata otteessaan pitelevälle pahalle kuningattarelle. Ilkeä hallitsija lähettää metsästäjän surmaamaan Lumikin, mutta tämä jättääkin tytön henkiin ja opettaa hänet tarttumaan miekkaan ja lähtemään taisteluun maan kohtalon puolesta. Lumikin lumovoima ja rohkeus saavat valtaansa myös prinssin. Amerikkalainen toiminta vuodelta 2012.",
    "start": 29431595,
    "stop": 29431730,
    "series_id": 31,
    "id": 77725209,
    "agelimit": 12,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "Suuri puhallus 2",
    "episode": "",
    "description": "Kukistettuaan FBI:n vuotta aiemmin neljä hevosmiestä odottavat uutta tehtävää heidät värvänneeltä taikurien joukolta nimeltä Silmä. Kun J. Daniel Atlas alkaa etsiä joukkoa omin päin, hevosmiehet päätyvät teknologisen neron Walter Mabrynluo, joka antaa hevosmiehille tehtäväksi varastaa tietojenharavointilaitteen. Sitä seuraavat tapahtumat ja yllätykset vaikuttavat menneisiin, nykyisiin ja tuleviin hahmoihin. Amerikkalainen toiminta vuodelta 2016.",
    "start": 29431730,
    "stop": 29431860,
    "series_id": 31,
    "id": 77725210,
    "agelimit": 12,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "Hellboy",
    "episode": "",
    "description": "Natsien käsistä pelastettu paholainen vaihtaa puolta ja ryhtyy taistelemaan pimeyden voimia vastaan. Amerikkalainen toiminta vuodelta 2004.",
    "start": 29431860,
    "stop": 29431990,
    "series_id": 31,
    "id": 77725211,
    "agelimit": 12,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "47 Meters Down: Uncaged",
    "episode": "",
    "description": "Neljä seikkailunhaluista teinityttöä lähtee tutkimaan muinaisen mayakaupungin raunioita 47 metriä merenpinnan alapuolella. Elämänsä seikkailuksi tarkoitettu retki muuttuu kuitenkin pian taisteluksi elämästä ja kuolemasta. Vedenalaiset rauniot ovat verenhimoisten valkohaiden metsästysalueita. Happipullojen tyhjentyessä kovaa vauhtia on heidän on löydettävä reitti ulos sokkeloisten raunioiden muodostamasta vedenalaisesta helvetistä. Amerikkalainen kauhu vuodelta 2017. (Iso-Britannia, 2019)",
    "start": 29431990,
    "stop": 29432076,
    "series_id": 31,
    "id": 77725212,
    "agelimit": 15,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "Silent Night",
    "episode": "",
    "description": "John Woon ohjaama kostotarina isästä (Joel Kinnaman), jonka todistaa pienen poikansa kuoleman jengiammuskelun ristitulessa jouluaattona. Toivuttuaan vammoistaan, jotka maksoivat hänelle puhekyvyn, mies ottaa elämäntehtäväkseen kostaa poikansa kuoleman. Amerikkalainen toiminta vuodelta 2023.",
    "start": 29432100,
    "stop": 29432220,
    "series_id": 31,
    "id": 77725213,
    "agelimit": 15,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "Vanquish",
    "episode": "",
    "description": "Damon Hickey (Morgan Freeman), eläkkeellä oleva komisario, sieppaa hoitajansa Victorian (Ruby Rose) tyttären ja kiristää näin naisen auttamaan kavaltamaan hänen rikolliset työtoverinsa ja puhdistamaan kaupungin ennen kuin on liian myöhäistä. Järkyttyneenä ainoan tuntemansa luotettavan miehen petoksesta Victoria taistelee tiensä läpi huumekauppiaiden ja alamaailman roistojen lauman pelastaakseen tyttärensä. Amerikkalainen toiminta vuodelta 2021.",
    "start": 29432220,
    "stop": 29432310,
    "series_id": 31,
    "id": 77725214,
    "agelimit": 15,
    "channel": 35,
    "rating": 0
  },
  {
    "name": "Suuri Puhallus",
    "episode": "",
    "description": "The Four Horsemen -ryhmä on silmänkääntäjien Robin Hood. Loisteliaiden taikuriesitysten aikana ryhmä maailman taitavimpia taikureita varastaa rahaa korruptoituneilta pankeilta ja monimiljonääreiltä sekä pudottaa setelit hämmentyneen yleisön päälle. Amerikkalainen trilleri vuodelta 2013.",
    "start": 29432340,
    "stop": 29432450,
    "series_id": 31,
    "id": 77725215,
    "agelimit": 12,
    "channel": 35,
    "rating": 0
  }
]