[
  {
    "id": 0,
    "name": "Kultarannan uusi aika",
    "start": "2025-12-16T17:49:00Z",
    "channel": 1,
    "description": "Tasavallan presidentin kesäasunto Kultaranta avautui kesäksi 2025 täysin peruskorjattuna. Remontissa kunnioitettiin arkkitehti Lars Sonckin alkuperäistä suunnitelmaa. Myös kymmenen hehtaarin puutarha uudistettiin alkuperäistä kunnioittaen.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Akuutti: Löytöretki lohtuun",
    "start": "2025-12-16T18:00:05Z",
    "channel": 1,
    "description": "Ani Kellomäki etsii ja löytää lohtua. Sitä tarjoavat yllättävien ammattilaisten lisäksi muiden muassa kaksikuiset aasivarsat sekä kehon ja mielen harjoitukset. Entä kuka tai mikä lohduttaa tähtitieteilijä Esko Valtaojaa?",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Yle Uutiset 20.30",
    "start": "2025-12-16T18:29:55Z",
    "channel": 1,
    "description": "",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Joulukalenteri: Tonttuakatemia",
    "start": "2025-12-16T17:45:00Z",
    "channel": 2,
    "description": "Joulupallo. Rouva Mantelista tuntuu, että kaikki vain laiskottelevat. Käynnissä on kuitenkin oppilaiden salainen operaatio rouva Mantelin syntymäpäiväjuhlien järjestämiseksi. Kuvailutulkattu. S02E16",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Siskonpeti: Joulu on ihmisen parasta aikaa",
    "start": "2025-12-16T17:57:00Z",
    "channel": 2,
    "description": "Välillä jokainen meistä toivoo, että olisi joulu ainainen. (U).",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Michael Palin Nigeriassa",
    "start": "2025-12-16T18:00:00Z",
    "channel": 2,
    "description": "3/3. Benin City. Matka jatkuu tierosvoja uhaten historialliseen Benin Cityyn ja luonnonkauniiseen Abrakaan. Lopuksi Michael päätyy keskelle valtavaa jumalanpalvelusta. (U)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Salatut elämät",
    "start": "2025-12-16T17:30:00Z",
    "channel": 3,
    "description": "Pihlajakatu 23 B on täynnä naurua, itkua, rakkautta ja suuria salaisuuksia. Perhesarjojen kiistelty ja kiitetty ykkönen jatkaa suuren suomalaisyleisön viihdyttäjänä. Tarinoiden keskiössä ovat Pihlajakadun asukkaat arjen käännekohdissa. S27E4864",
    "episode": "Alexsson"
  },
  {
    "id": 0,
    "name": "Suomalainen menestysresepti",
    "start": "2025-12-16T18:00:00Z",
    "channel": 3,
    "description": "Kilpajuoksu kohti kauppojen hyllyjä jatkuu, kun finalistit hiovat tuotteidensa maut minttiin. Kilpailutuotteet siirtyvät kohti teollista valmistusta. Samuli kohtaa vastoinkäymisiä ja Antti yllättää tuomariston. S05E05",
    "episode": "Maku ratkaisee"
  },
  {
    "id": 0,
    "name": "Lomalle lompsis",
    "start": "2025-12-16T19:00:00Z",
    "channel": 3,
    "description": "Hengenvaara on läsnä useampaan otteeseen, eikä onnettomuuksilta vältytä. Sanna pääsee ylittämään itsensä varjoliidossa, vaikka jalat meinaavat pettää alta. Aktiiviloma Alpeilla ei jätä ketään kylmäksi. S01E04",
    "episode": "Innsbruck, Itävalta"
  },
  {
    "id": 0,
    "name": "Himohamstraajat",
    "start": "2025-12-16T17:00:00Z",
    "channel": 4,
    "description": "Brucen ja Cathyn talon raivaaminen jatkuu. Bruce on vastahakoinen, eikä Cathy uskalla vastustaa häntä. Saako tiimi parin luovuttamaan vai jääkö urakka puolitiehen? Amerikkalainen dokumentaarinen sarja. (Yhdysvallat, 2024) S16E12",
    "episode": "Kirpparihaukat 2/2"
  },
  {
    "id": 0,
    "name": "Suomen huutokauppakeisari",
    "start": "2025-12-16T18:00:00Z",
    "channel": 4,
    "description": "Friman myy räjähdelaatikkoa ja klassikkolehtiä. Markku ja Erkki paahtavat rännärillä Hirvaskankaan tesinkki-kahvin. Kotimainen realitysarja. (2024) S18E06",
    "episode": "Kahvia ja pullaa"
  },
  {
    "id": 0,
    "name": "Kaverille ei jätetä - IKUISET",
    "start": "2025-12-16T19:00:00Z",
    "channel": 4,
    "description": "Illan jakso kertoo kaikille tutuista firman pikkujouluista. .Pääosissa mm. Ona Kamu, Kaija Kangas, Janne Reinikainen, P-P Petelius, Antti Litja, Vesa Vierikko ja Martti Suosalo. Kotimainen komediasarja. (2010) S01E09",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Mestis: Jokerit - Pyry",
    "start": "2025-12-16T16:15:00Z",
    "channel": 5,
    "description": "Selostajana Juho Kokko. S2025E10",
    "episode": "Jokerit - Pyry (16.12.2025)"
  },
  {
    "id": 0,
    "name": "Beck: Elävältä haudattu",
    "start": "2025-12-16T19:00:00Z",
    "channel": 5,
    "description": "Syyttäjä löydetään elävältä haudattuna lasten hiekkalaatikosta. Pian uhreja löytyy enemmänkin, ja Beck kollegoineen huomaa olevansa tekemisissä sarjamurhaajan kanssa. Tilanne käy tukalaksi, kun tekijä ottaa yhteyttä suoraan Beckiin. Pääosissa: Peter Haber, Mikael Persbrandt, Stina Rautelin, Måns Nathanaelson, Rebecka Hemse. Ohjaus: Harald Hamrell. (Beck: Levande begravd (26), Sweden, 2009)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Kolmosvaihde",
    "start": "2025-12-16T20:45:00Z",
    "channel": 5,
    "description": "Kolmosvaihteen vieraana on taiteilija Sofia Zida. .Meksikolais-suomalainen muusikko on luonut autostaan todellisen taideteoksen. Tutustuimme valtakunnan suurimpaan trailerikauppiaaseen Valle Mäkelään. S06E09",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Yle Nyheter TV-nytt 19.30",
    "start": "2025-12-16T17:30:00Z",
    "channel": 13,
    "description": "Viimeisimmät uutiset, uutisanalyysit ja reportaasit ruotsinkieliseltä rannikkoseudulta, muualta Suomesta ja maailmalta.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "YLE TEEMA",
    "start": "2025-12-16T18:00:00Z",
    "channel": 13,
    "description": "",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Norjaa ristiin rastiin",
    "start": "2025-12-16T17:53:42Z",
    "channel": 13,
    "description": "Kerran viikossa Nærleiken päiväkodin lapset pääsevät opettelemaan hiihtämistä. Nyt leivotaan tulevia hiihtomestareita.",
    "episode": "Lasten hiihtokoulu"
  },
  {
    "id": 0,
    "name": "Panttilainaamo",
    "start": "2025-12-16T17:00:00Z",
    "channel": 56,
    "description": "Chumlee pääsee tutkimaan dinosauruksia, kun asiakas tarjoaa Jurassic Park -lelukokoelmaansa myyntiin. Rick taas lähtee reissuun tutkimaan 1700-luvun espanjalaista tykkiä, josta pyydetään kovaa hintaa.  Amerikkalainen realitysarja. (Yhdysvallat, 2021) S24E34",
    "episode": "Panttisaurus rex"
  },
  {
    "id": 0,
    "name": "Amerikan kovimmat keräilijät",
    "start": "2025-12-16T18:00:00Z",
    "channel": 56,
    "description": ".Mike lähettää Jersey Jonin ja Robbien tapaamaan moottoripyöräharrastajaa, joka onkin Jonin tuttu yhteisen harrastuksen kautta. Vaikka he ovat pahasti myöhässä käynnin alkuperäisen syyn suhteen, kiinnostavaa ja taidolla valmistettua nähtävää riittää. Mike käy katsomassa huoltamon hyötykäyttöön muokattua vanhaa moottoripyörää, joka onkin koottu varsin mielenkiitoisella ja taitavalla tavalla. Kiinnostusta löytyy, mutta onko vahva tunneside este pyörän myymiselle? Amerikkalainen realitysarja. (Yhdysvallat, 2019) S21E29",
    "episode": "Moottoripyöriä ja törmäilyautoja"
  },
  {
    "id": 0,
    "name": "Amazing Race Suomi",
    "start": "2025-12-16T19:00:00Z",
    "channel": 56,
    "description": "Väki vähenee ja kilpailu kovenee. Viides etappi haastaa tiimit kielimuurin eteen tuomilla yllättävillä esteillä kuin hajuntäyteisillä karsinoilla ja seinilläkin. Kahdeksan tiimiä on jäljellä kilpailussa, mutta yhdenkään parin kohtalo ei ole sinetöity ennen etapin päätepistettä ja Heikin kohtalonlauseita. Ohjelman juontaa Heikki Paasonen Kotimainen realitysarja. (2025) S03E05",
    "episode": "Lantahommia"
  },
  {
    "id": 0,
    "name": "Syke",
    "start": "2025-12-16T17:35:00Z",
    "channel": 63,
    "description": "Leevi haluaa itselleen paremman auktoriteetin. .Max ymmärtää mustasukkaisuutensa ja antaa Jannican tehdä mitä haluaa. Ilmari kohtaa viimein menneisyyden haamunsa. Kotimainen draama. (2021) S18E16",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Vain elämää: Kaikki biisit",
    "start": "2025-12-16T18:05:00Z",
    "channel": 63,
    "description": "Ja taas jytisee! Poski poskea vasten ja tanssikengät jalkaan - nyt mennään! Tiedossa on musiikin ilotulitusta alusta loppuun, kun kuulemme loput kauden biiseistä.\r Lavalla musisoivat Käärijä, Lauri Haav, VIIVI, Pelle Miljoona, Mikki Kauste, Vesta, Johannes Brotherus ja Jonna Tervomaa.\r  Kotimainen musiikkiohjelma. (2025) S16E15",
    "episode": "Kaikki biisit 2/2"
  },
  {
    "id": 0,
    "name": "Brittien ökyimmät myyntikohteet",
    "start": "2025-12-16T20:20:00Z",
    "channel": 63,
    "description": "Hertfordshiressä välittäjä Margaret tapaa tutut asuntoflippaajat, jotka ovat saaneet nykyisen kotinsa remontoitua ja kaipaavat uutta kohdetta. Jerseyn saarella toinen Margaret käy arvioimassa vielä keskeneräisen luksushuvilan. Englantilainen dokumenttisarja. (Iso-Britannia, 2025) S03E07",
    "episode": "Luksusflippaajat"
  },
  {
    "id": 0,
    "name": "Harry Potter: Leipurivelhot",
    "start": "2025-12-16T17:00:00Z",
    "channel": 88,
    "description": "Magical Beasts, Beings, and Creatures. .Kilpailussa jäljellä olevat neljä joukkuetta luovat mestariteoksia, jotka herättävät henkiin Harry Potterin ikonisen hahmon. (Iso-Britannia, 2025) S02E05",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Kaikki vastaan kaikki",
    "start": "2025-12-16T17:55:00Z",
    "channel": 88,
    "description": "Kunniatohtori Peter Nyman hämmentää kilpailijoita. Veronica Verho ja Juhani Koskinen sekä HP Parviainen ja Jarno Laasala haluavat finaaliin. Isäntinä Aku Hirviniemi ja Kalle Lamberg. Suomen suosituimmat julkkikset pelaavat Kalle Lambergin ja Aku Hirviniemen johdolla tietokilpailuja. (2024) S01E14",
    "episode": "Designia ja ampiaisia"
  },
  {
    "id": 0,
    "name": "Tappava ase 3",
    "start": "2025-12-16T19:00:00Z",
    "channel": 88,
    "description": "Lethal Weapon 3. Los Angelesin poliisietsivät Riggs ja Murtaugh tulevat, näkevät ja tekevät pahaa jälkeä jäljittäessään rikollisia, jotka myyvät laittomasti aseita. N: Danny Glover, Joe Pesci, Mel Gibson. O: Richard Donner. (Yhdysvallat, 1992)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Wheeler Dealers",
    "start": "2025-12-16T17:50:00Z",
    "channel": 64,
    "description": "Mike etsii klassista pakettiautoa, mutta kalliit hinnat pakottavat hänet tyytymään vähemmän suosittuun malliin. Pystyykö Edd toteuttamaan kunnianhimoiset kohennussuunnitelmat? Jensen Interceptor. Mike haluaa klassisen Jensen Interceptorin. Auto on uutena talon hintainen, mutta jos hän löytää käytetyn alle 6000 eurolla, Edd pystyy ehkä tekemään siitä vielä ajokelpoisen. (Iso-Britannia, 2010) S07E03",
    "episode": "VW T2 Panel Van"
  },
  {
    "id": 0,
    "name": "Doctor Sleep",
    "start": "2025-12-16T19:00:00Z",
    "channel": 64,
    "description": "Lapsuutensa tapahtumista Overlook-hotellissa pysyvästi traumatisoitunut Dan Torrance on taistellut saavuttaakseen edes jonkinlaisen rauhan sisällään. Mutta tämä rauha murskaantuu hänen kohdatessaan Abran, rohkean nuoren tytön, jolla on myös voimakas ´hohdoksi´ kutsuttu yliluonnollinen kyky. Abra on tunnistanut vaistomaisesti saman kyvyn Danissa ja etsinyt hänet käsiinsä saadakseen apua armotonta Rose the Hatia vastaan. N: Rebecca Ferguson, Ewan McGregor, Kyliegh Curran. O: Mike Flanagan. (Yhdysvallat, 2019)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Poliisien matkassa",
    "start": "2025-12-16T21:55:00Z",
    "channel": 64,
    "description": "Uudessa-Meksikossa sydänkohtausta esittänyt vanki hyökkää vartijan päälle. Nebraskassa perhe joutuu toisen perheen ilotulitushyökkäyksen kohteeksi. (Iso-Britannia, 2024) S05E11",
    "episode": "Crying Wolf"
  },
  {
    "id": 0,
    "name": "Joulu tähtien loisteessa",
    "start": "2025-12-16T17:00:00Z",
    "channel": 60,
    "description": "Nick saa potkut hyväpalkkaisesta työstään sijoitusfirmassa ja päätyy töihin Clemille, joka pyörittää joulukuusikauppaa viimeistä kertaa ennen eläkkeelle jäämistä. Clemin kautta Nick tapaa opettaja Julien ja tämän Matt-pojan. Julien avulla Nick löytää uusia puolia itsestään ja ymmärtää, ettei työ ehkä olekaan maailman tärkein asia. (Christmas Under the Stars, Yhdysvallat, 2019)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Olet mitä syöt",
    "start": "2025-12-16T19:00:00Z",
    "channel": 60,
    "description": "Meteorologi Pekka Poutaa mietityttää haasteet liittyen verenpaineeseen, kolesteroliin, elintapoihin ja mahdollisiin eturauhasvaivoihin. Hyvinvointilääkäri Pippa Laukka rientää avuksi. S07E03",
    "episode": "Eturauhasen asialla"
  },
  {
    "id": 0,
    "name": "Tähtien loisteessa",
    "start": "2025-12-16T20:00:00Z",
    "channel": 60,
    "description": "Romanttisessa draamaelokuvassa Annie tarttuu toimeen, kun hänen vanhempiensa kahvila uhataan jyrätä maan tasalle. Annie saa vastaansa hankkeesta vastaavan liikemiehen, mutta kohtaaminen avaa yllättäen molempien silmät. (Christmas by Starlight, United States, 2020)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Suuri seikkailu",
    "start": "2025-12-16T17:30:00Z",
    "channel": 103,
    "description": "Kuukkelit tuovat leireihin vihjeitä päivän kilpailusta. .Keltaisessa leirissä on otettu opiksi edellisen kisan virheestä ja joukkue lähtee voittoa uhkuen kohti Pallastunturin poronerotteluaitausta. Joukkuekilpailusta kehkeytyy jännittävä näytelmä, kun mitataan kilpailijoiden tietämystä poroista ja suopungeista. Ilman yhteispeliä ja sisua ei tästäkään kiihkeästä kilpailusta kukaan selviä voittajana. Hävinneen joukkueen kapteenin rooli muodostuu erittäin raskaaksi. Kotimainen realitysarja. (2024) S02E06",
    "episode": ""
  },
  {
    "id": 0,
    "name": "NCIS Rikostutkijat",
    "start": "2025-12-16T19:00:00Z",
    "channel": 103,
    "description": ".NCIS kutsutaan halloween-iltana juhliin, joissa on kiistaa talon oikeasta omistajasta ? ja lopulta kellarista löytyykin ruumis. Amerikkalainen rikosdraamasarja. (Yhdysvallat, 2024) S22E03",
    "episode": "Mittaamattoman arvokas aarre"
  },
  {
    "id": 0,
    "name": "Poliisit 2017",
    "start": "2025-12-16T20:00:00Z",
    "channel": 103,
    "description": "Ratsupoliisit Teemu ja Timo ovat mukana turvaamassa Stadin derbyä. Uhkaavissa yhteenotoissa urheilun nimeen ovat vaarassa niin sivulliset, poliisit kuin hevosetkin. Mikä on Palaad-hevosen suurin heikkous? Kotimainen dokumentaarinen sarja. (2016) S09E09",
    "episode": "Helsinki"
  },
  {
    "id": 0,
    "name": "Jolly Good Christmas",
    "start": "2025-12-16T16:25:00Z",
    "channel": 104,
    "description": "Arkkitehti David palkkaa eloisan ostosavustaja Anjin löytääkseen täydellisen joululahjan tyttöystävälleen ja ajautuu odottamattomalle seikkailulle Lontoon halki. N: Will Kemp, Reshma Shetty. O: Jonathan Wright. (Yhdysvallat, 2022)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Teho-osasto",
    "start": "2025-12-16T18:00:00Z",
    "channel": 104,
    "description": "Banfield ja Abby ottavat yhteen potilaan hoidon suhteen. Tämä provosoiva draamasarja esittelee urbaanin sairaalan ensiapupoliklinikan kaaosta ja siellä työskentelevien lääkärien elämää. Draamasarja seuraa lääkäreiden ja potilaiden henkilökohtaista ja ammatillista elämää chicagolaisen sairaalan päivystyksessä. (Yhdysvallat, 2008) S15E03",
    "episode": "The Book of Abby"
  },
  {
    "id": 0,
    "name": "Mentalisti",
    "start": "2025-12-16T19:00:00Z",
    "channel": 104,
    "description": "J.J. LaRoche ja Rigsbyn isä palaavat. Golden Globe -ehdokas Simon Baker esittää Patrick Janea, California Bureau of Investigationin (CBI) itsenäistä konsulttia, joka on äärimmäisen taitava ratkaisemaan vakavia rikoksia. S05E04",
    "episode": "Blood Feud"
  },
  {
    "id": 0,
    "name": "Miehen puolikkaat",
    "start": "2025-12-16T17:40:00Z",
    "channel": 123,
    "description": "Alan heittäytyy liian rehelliseksi kuultuaan Lyndseyn pornourasta. Berta opettaa Waldenia leipomaan. Amerikkalainen komediasarja. (Yhdysvallat, 2011) S09E05",
    "episode": "Hämärä menneisyys"
  },
  {
    "id": 0,
    "name": "Rillit huurussa",
    "start": "2025-12-16T18:05:00Z",
    "channel": 123,
    "description": "Sheldonin on päätettävä mikä määrä Amya on liikaa, kun tämä ottaa vastaan työpaikan Sheldonin yliopistolta ja heidän suhteensa joutuu koetukselle. Howard päätyy nukkumaan Rajin sohvalle riideltyään Bernadetten kanssa. (Yhdysvallat, 2013) S07E05",
    "episode": "Työpaikan läheisyys"
  },
  {
    "id": 0,
    "name": "Rillit huurussa",
    "start": "2025-12-16T18:30:00Z",
    "channel": 123,
    "description": "Sheldon tuntee olevansa huijari uusimman tieteellisen läpimurtonsa takia, mikä uhkaa kummitella häntä hänen loppuelämänsä ajan. Howardin romanttinen ele Bernadettea kohtaan saa Pennyn yrittämään enemmän Leonardin suhteen. (Yhdysvallat, 2013) S07E06",
    "episode": "Romanssiresonanssi"
  },
  {
    "id": 0,
    "name": "MTV Uutiset Live",
    "start": "2025-12-16T23:00:00Z",
    "channel": 30,
    "description": "Kausi 2025, jakso 700/732. Tärkeimmät uutiset ja kiinnostavimmat puheenaiheet - aina!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "MTV Uutiset Live",
    "start": "2025-12-17T23:00:00Z",
    "channel": 30,
    "description": "Kausi 2025, jakso 702/732. Tärkeimmät uutiset ja kiinnostavimmat puheenaiheet - aina!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "MTV Uutiset Live",
    "start": "2025-12-18T23:00:00Z",
    "channel": 30,
    "description": "Kausi 2025, jakso 704/732. Tärkeimmät uutiset ja kiinnostavimmat puheenaiheet - aina!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Daltonit",
    "start": "2025-12-16T17:35:00Z",
    "channel": 74,
    "description": "Daltonien uudet kasvot / Poppamies Pitkäviha / Jälleensyntyminen. .Animaatiosarja surkuhupaisista Daltonin veljeksistä, joiden ryöstöretket päätyvät aina vankilaan, mutta vapauden kaipuu on sammumaton. Luvassa on toinen toistaan ovelampia pakoyrityksiä, mutta aina joku tunaroi ratkaisevalla hetkellä. Mukana toiminnassa häärää vankilan vahtikoira Rantanplan, jolla ei ole hajuakaan mitä pitäisi vahtia ja miksi. S02E18",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Muumilaakson tarinoita",
    "start": "2025-12-17T04:00:00Z",
    "channel": 74,
    "description": "Muumiperheen on aika käydä talviunille, mutta sitä ennen syödään yhdessä juhla-ateria. Yllättävä vieras saapuu mukaan juhlimaan. Lapsien rakastama Muumilaakson tarinoita on vuosina 1990-1992 tehty animaatiosarja, joka kertoo Tove Janssonin luomien muumien ja heidän ystäviensä seikkailuista Muumilaaksossa. S01E16",
    "episode": "Kohta tulee joulu"
  },
  {
    "id": 0,
    "name": "Muumilaakson tarinoita",
    "start": "2025-12-17T04:25:00Z",
    "channel": 74,
    "description": "Muumipappa tahtoo viedä perheensä tutustumaan oikeaan majakkaan. Matkalla he törmäävät omituiseen laivaan ja perillä selviää, että majakassa ei ole vartijaa. S01E17",
    "episode": "Matka majakalle"
  },
  {
    "id": 0,
    "name": "La Liga Highlights",
    "start": "2025-12-16T19:00:00Z",
    "channel": 105,
    "description": "Koosteohjelma La Liga MD 16 kierrokselta. .Tärkeimmät tapahtumat sekä parhaimman pelaajan, maalin ja torjunnan esittely. Englanninkielinen ohjelma. La Ligan kierroskohtainen koosteohjelma. Kaikki maalit ja tärkeimmät tapahtumat sekä kierroksen parhaimman pelaajan, maalin ja torjunnan esittely. S2025E16",
    "episode": ""
  },
  {
    "id": 0,
    "name": "MTV Uutiset Live",
    "start": "2025-12-16T23:00:00Z",
    "channel": 105,
    "description": "Kausi 2025, jakso 700/732. Tärkeimmät uutiset ja kiinnostavimmat puheenaiheet - aina!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "MTV Uutiset Live",
    "start": "2025-12-17T04:00:00Z",
    "channel": 105,
    "description": "Kausi 2025, jakso 701/732. Tärkeimmät uutiset ja kiinnostavimmat puheenaiheet - aina!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Motorsport Mundial",
    "start": "2025-12-16T17:50:00Z",
    "channel": 106,
    "description": "Viikoittainen moottoriurheiluohjelma, joka tarjoaa tuoreimmat uutiset, kisakuvaukset ja analyysit vesiurheilusta kaksi- ja nelipyöräisiin saakka. .Englanninkielinen ohjelma. S2025E51",
    "episode": ""
  },
  {
    "id": 0,
    "name": "MTV Uutiset Live",
    "start": "2025-12-16T23:00:00Z",
    "channel": 106,
    "description": "Kausi 2025, jakso 700/732. Tärkeimmät uutiset ja kiinnostavimmat puheenaiheet - aina!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "MTV Uutiset Live",
    "start": "2025-12-17T23:00:00Z",
    "channel": 106,
    "description": "Kausi 2025, jakso 702/732. Tärkeimmät uutiset ja kiinnostavimmat puheenaiheet - aina!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Catfish: The TV Show",
    "start": "2025-12-16T17:25:00Z",
    "channel": 32,
    "description": "Tristyn on rakastunut Laraan, jonka kanssa Tristyn on jutellut jo vuosia, mutta jota hän ei ole koskaan tavannut tosielämässä! Kun Nev ja Kamie tutkivat asiaa, esiin nousee faktoja, jotka saavat kaikki kyseenalaistamaan Laran ja hänen rakkautensa. S07E38",
    "episode": "Tristyn & Lara"
  },
  {
    "id": 0,
    "name": "Ink Master: Turf War",
    "start": "2025-12-16T18:15:00Z",
    "channel": 32,
    "description": "Juuri kun joukkueet luulevat selvittäneensä reviirisodan, järkyttävä käänne saa kilpailun tuleen ja polttaa sen karrelle. Panoksena on 100 000 dollarin potti & Ink Masterin titteli. S13E05",
    "episode": "Ei omassa elementissä"
  },
  {
    "id": 0,
    "name": "Ridiculousness",
    "start": "2025-12-16T19:00:00Z",
    "channel": 32,
    "description": "Sterling and Lolo Wood XLVIII. .Tässä Ridiculousness-jaksossa Rob, Steelo ja Lolo Wood harrastavat Maastokajakointia, ihmettelevät Taaperoansoja sekä näkevät kömpelöitä ihmisiä osiossa Ei tilantajua. S41E04",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Top 50 Greatest 80s Hits At Xmas!",
    "start": "2025-12-16T15:00:00Z",
    "channel": 124,
    "description": "Check out the ultimate 80s Xmas Hits playlist right here with the Top 50 tracks of all time!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Guess The Year",
    "start": "2025-12-16T20:00:00Z",
    "channel": 124,
    "description": "Test your musical knowledge! Can you guess the year in which the following set of classic videos were released?",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Christmas Wrapped!",
    "start": "2025-12-16T21:00:00Z",
    "channel": 124,
    "description": "Join us as we unwrap the biggest and best Christmas hits that are guaranteed to get your bells jingling!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "MTV 90s @ The Movies!",
    "start": "2025-12-16T17:20:00Z",
    "channel": 125,
    "description": "Grab your popcorn, MTV 90s is heading to the movies, with all the big-screen soundtrack hits of the decade!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Alternative Nation!",
    "start": "2025-12-16T20:00:00Z",
    "channel": 125,
    "description": "Become part of the 90s Alternative Nation right now on MTV 90s!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Ultimate 90s Playlist!",
    "start": "2025-12-16T21:00:00Z",
    "channel": 125,
    "description": "Nothing but the best tracks and ultimate anthems from the 90s.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Non-Stop Nostalgia!",
    "start": "2025-12-16T17:00:00Z",
    "channel": 126,
    "description": "Start reminiscing about the good old days with this non-interrupted playlist filled with all of your favourite hits from back in the day!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Best Collabs Of The Decade!",
    "start": "2025-12-16T19:00:00Z",
    "channel": 126,
    "description": "There's nothing better than seeing your favourite artists combine their creative forces to create one epice hit, so let's take a look at the best collabs of the 00s! Enjoy!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Hits Don't Lie",
    "start": "2025-12-16T20:00:00Z",
    "channel": 126,
    "description": "Hits don't lie! Get ready for the biggest and best worldwide smashes from past to present!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Totally 10s!",
    "start": "2025-12-16T17:00:00Z",
    "channel": 127,
    "description": "All the hits from the 10s in one place - what more could you want?",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Worldwide Hits!",
    "start": "2025-12-16T20:00:00Z",
    "channel": 127,
    "description": "We've got a playlist filled with the hottest hits that have taken over the world!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "MTV Top 20 Of 2024!",
    "start": "2025-12-16T23:00:00Z",
    "channel": 127,
    "description": "Let's take a look at some of the biggest hits global of 2024 in this top 20 countdown!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Party Anthems!",
    "start": "2025-12-16T17:00:00Z",
    "channel": 128,
    "description": "Turn up the bass, pump up the volume...here are Club MTV's massive party anthems!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Club Classics!",
    "start": "2025-12-16T18:00:00Z",
    "channel": 128,
    "description": "We're going big on dancefloor smashes from across all the decades - that's massive tunes from the 80s, 90s, 00s and 10s!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Big Tunes!",
    "start": "2025-12-16T23:00:00Z",
    "channel": 128,
    "description": "Classic anthems or new dancefloor smashes. As long as they're big tunes, we're playing them all right now!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Eat, Sleep, Dance, Repeat!",
    "start": "2025-12-16T17:00:00Z",
    "channel": 129,
    "description": "Eat, sleep, dance, repeat! Eat, sleep, dance, repeat! Eat, sleep...you get the idea! These are your essential dance hits to get you through the day!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Rock.Alt.Indie",
    "start": "2025-12-16T18:00:00Z",
    "channel": 129,
    "description": "Plug in your guitar and amp up the volume because we're bringing you the best of the best from the Rock, Alternative and Indie scene!",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Coldplay: Storytellers",
    "start": "2025-12-16T19:00:00Z",
    "channel": 129,
    "description": "Kausi 8, jakso 3. Coldplay chat about and performs songs from their third album \"X&Y\", as well as revealing the stories behind some of their biggest hits.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Yle Nyheter TV-nytt 19.30",
    "start": "2025-12-16T17:30:00Z",
    "channel": 22,
    "description": "Viimeisimmät uutiset, uutisanalyysit ja reportaasit ruotsinkieliseltä rannikkoseudulta, muualta Suomesta ja maailmalta.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Pentulive: Eka vuosi",
    "start": "2025-12-16T18:00:00Z",
    "channel": 22,
    "description": "Uuteen kotiin. Loimun pennut Kipinä, Pilke ja Kulo muuttavat uusiin koteihinsa ja saavat uudet nimet. Laumautumisessa on kuitenkin omat haasteensa. Uusi sarja. S01E01",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Yle Uutiset 20.30",
    "start": "2025-12-16T18:29:55Z",
    "channel": 22,
    "description": "",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Koputus",
    "start": "2025-12-16T17:30:00Z",
    "channel": 65,
    "description": "Vieraana Jussi Koivukangas Vaasasta.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Jumala puhuu",
    "start": "2025-12-16T18:00:00Z",
    "channel": 65,
    "description": "Rakkaus pysyy. Agape rakkaus, Jumalan rakkaus, ansaitsematon, ehtymätön, ikuinen rakkaus.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Jerusalem studio",
    "start": "2025-12-16T18:30:00Z",
    "channel": 65,
    "description": "Jerusalem studio",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Moottoriurheilu: FIA Awards",
    "start": "2025-12-16T17:30:00Z",
    "channel": 49,
    "description": "Makasiini.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Ratsastus: Hypyt | Geneve",
    "start": "2025-12-16T18:00:00Z",
    "channel": 49,
    "description": "Grand Slam turnaus.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Snooker: Scottish Open, 1. kierros",
    "start": "2025-12-16T19:00:00Z",
    "channel": 49,
    "description": "Home Nations Series.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "DP World Tour: DPWT Alfred Dunhill Championship - 4. kierros",
    "start": "2025-12-16T13:00:00Z",
    "channel": 83,
    "description": "DPWT Alfred Dunhill Championship - 4. .kierros. Kilpailu pelataan Old Coursella, St. Andrewsissa, Skotlannissa. (11.-14.12.2025) (Iso-Britannia, 2026) S2026E16",
    "episode": ""
  },
  {
    "id": 0,
    "name": "DP World Tour: DPWT Alfred Dunhill Championship - 4. kierros",
    "start": "2025-12-16T18:00:00Z",
    "channel": 83,
    "description": "DPWT Alfred Dunhill Championship - 4. .kierros. Kilpailu pelataan Old Coursella, St. Andrewsissa, Skotlannissa. (11.-14.12.2025) (Iso-Britannia, 2026) S2026E16",
    "episode": ""
  },
  {
    "id": 0,
    "name": "DP World Tour Highlights",
    "start": "2025-12-16T23:00:00Z",
    "channel": 83,
    "description": "Kohokohtia kilpailusta, joka pelattiin Old Coursella, St. Andrewsissa, Skotlannissa. (11.-14.12.2025) (Iso-Britannia, 2026) S2026E03",
    "episode": "Alfred Dunhill Championship"
  },
  {
    "id": 0,
    "name": "Bundesliga Highlights",
    "start": "2025-12-16T17:00:00Z",
    "channel": 86,
    "description": "Kohokohtia Bundesliigan viimeisimmältä kierrokselta. (Ruotsi, 2025) S2025E15",
    "episode": "Bundesliga Highlights"
  },
  {
    "id": 0,
    "name": "EFL Championship Highlights",
    "start": "2025-12-16T18:00:00Z",
    "channel": 86,
    "description": "Kohokohtia EFL Championshipin viimeisimmältä kierrokselta. (Ruotsi, 2025) S2025E16",
    "episode": "EFL Championship Highlights"
  },
  {
    "id": 0,
    "name": "Ligue 1 Highlights",
    "start": "2025-12-16T18:30:00Z",
    "channel": 86,
    "description": "Kohokohtia Ligue 1:n viimeisimmältä kierrokselta. (Ruotsi, 2025) S2025E17",
    "episode": "Ligue 1 Highlights"
  },
  {
    "id": 0,
    "name": "Tiny Toons Looniversity",
    "start": "2025-12-16T17:50:00Z",
    "channel": 68,
    "description": "During a camping trip, Sweetie admits she’s afraid of something in the woods and after a round of scary stories, everyone finds out what’s out there. .Tiny Toons Looniversity follows Babs and Buster Bunny, Sweetie Bird, Hamton J. Pig, and Plucky Duck as they learn what it takes to be a professional toon under the tutelage of Bugs Bunny, Daffy Duck and other looney legends. (2023) S02E06",
    "episode": ""
  },
  {
    "id": 0,
    "name": "The Amazing World of Gumball",
    "start": "2025-12-16T18:15:00Z",
    "channel": 68,
    "description": "When the uncomfortableness between them reaches new levels, Gumball and Hot Dog Guy decide they have to confront their ongoing awkwardness by making things as awkward as possible. .Gumball’s world is pretty run-of-the-mill. He’s chased around school by a T-Rex. He has a friend named Anton who’s a piece of toast. He’s got a crush on Penny, a peanut with antlers. His dad is a 6’4” bunny. His mom works at a Rainbow Factory. And his brother is a goldfish named Darwin. Yup, everything looks perfectly normal. (2017) S06E09",
    "episode": ""
  },
  {
    "id": 0,
    "name": "The Amazing World of Gumball",
    "start": "2025-12-16T18:30:00Z",
    "channel": 68,
    "description": "When their neighbor tries to bring over a package for them, Gumball and Darwin realize they have never learned his name, and it’s way too late to ask. .They try everything to figure out what it is, but when they do they find out there are bigger secrets to learn about their neighbor than just his name... Gumball’s world is pretty run-of-the-mill. He’s chased around school by a T-Rex. He has a friend named Anton who’s a piece of toast. He’s got a crush on Penny, a peanut with antlers. His dad is a 6’4” bunny. His mom works at a Rainbow Factory. And his brother is a goldfish named Darwin. Yup, everything looks perfectly normal. (2018) S06E13",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Wheeler Dealers",
    "start": "2025-12-16T16:55:00Z",
    "channel": 6,
    "description": "Mike on lähtenyt seikkailemaan 1970-vuosimallin Ford Broncolla. Kun se osoittautuu ruosteromuksi, Mike tekee kaikkensa pelastaakseen projektin, kun taas Edd pysyy viilipyttynä. Huonokuntoiset klassikkoautot saavat Mike Brewerin ja Edd Chinan osaavissa käsissä uuden elämän. Mikella on ehtymätön vainu löytää romun seasta helmet, minkä jälkeen mekaanikko Edd pistää tuulemaan. Kunnostuksen jälkeen kaksikon tavoitteena on myydä uusiutunut menopeli voitolla eteenpäin. (Iso-Britannia, 2016) S13E10",
    "episode": "1970 Ford Bronco"
  },
  {
    "id": 0,
    "name": "Gold Rush - Kultakuume",
    "start": "2025-12-16T18:00:00Z",
    "channel": 6,
    "description": "Rick ei tottele uuden kohteen sääntöjä vaan tekee riskiliikkeen. Parkerin johtomies Tyson tuskailee tulvan ja uusien työntekijöiden kanssa. (Yhdysvallat, 2025) S16E03",
    "episode": "Rick's Bold Call"
  },
  {
    "id": 0,
    "name": "Gold Rush - Kultakuume",
    "start": "2025-12-16T19:00:00Z",
    "channel": 6,
    "description": "Parker painostaa Mitchiä tuomaan kultaa Sulphur Creekistä ja kirjaa ison tuloksen. Buzz saa epävakuuttavan kohteen ja Tony testaa uutta työnjohtajaa. (Yhdysvallat, 2025) S16E04",
    "episode": "Buzz In The Hills"
  },
  {
    "id": 0,
    "name": "Kalliovuorten eläinlääkäri",
    "start": "2025-12-16T17:00:00Z",
    "channel": 9,
    "description": "Eläinlääkäri Nichols hoitaa naapurin koiran kanssa tappelussa loukkaantunutta kissaa. Neljäsluokkalaisten kaikki toivo on Jeffissä, että tämä pystyisi pelastamaan lemmikkisiilin. Denverin intohimoisin ja periksiantamattomin eläinlääkäri Jeff Young luotsaa Planned Pethood Plus -klinikkaansa suurella sydämellä. Dr. Jeff tiimeineen hoitaa kaikenkarvaisia eläimiä sekä klinikalla että siirtymällä tarpeen tullen paikan päälle syrjäisiin kohteisiin. (Iso-Britannia, 2015) S02E02",
    "episode": "Beware of Cat"
  },
  {
    "id": 0,
    "name": "Uskomattomat puumajat",
    "start": "2025-12-16T18:00:00Z",
    "channel": 9,
    "description": "Pete rakentaa kiipeilijöiden keitaan pariskunnalle, joka rakastaa puita ehkä jopa enemmän kuin hän. Majan huonekorkeus on viisi metriä ja sen kattoparrut on jätetty esille. Pete Nelson tiimeineen rakentaa toinen toistaan uskomattomampia puumajoja ihmisille, jotka haluavat kosketuksiin luonnon kanssa. (Yhdysvallat, 2014) S03E05",
    "episode": "Kentucky Climber's Cottage"
  },
  {
    "id": 0,
    "name": "Beast Lands",
    "start": "2025-12-16T19:00:00Z",
    "channel": 9,
    "description": "Intialainen maalaiskylä joutuu ihmisen ja ihmissyöjän välisen konfliktin etulinjalle ja tiikerien hyökkäykset lisääntyvät. Dave Salmoni lähtee selvittämään niiden syytä. S01E03",
    "episode": "Killer Tigers"
  },
  {
    "id": 0,
    "name": "Unelmakoti 100 päivässä",
    "start": "2025-12-16T16:50:00Z",
    "channel": 12,
    "description": "Elinikäiset floridalaiset ostivat 74 vuotta vanhan vintage-rantahotellin heti, kun se tuli markkinoille, mutta se tarvitsee perusteellisen remontin. (Yhdysvallat, 2022) S04E13",
    "episode": "Checking In"
  },
  {
    "id": 0,
    "name": "Sisarvaimoa etsimässä",
    "start": "2025-12-16T17:55:00Z",
    "channel": 12,
    "description": "Garrick ja Lorrana saapuvat oikeustaloon mennäkseen naimisiin, mutta Dannielle on ristiriitaisten tunteiden vallassa. Matt Johnson toivoo voivansa suostutella Shanayn jäämään. (Yhdysvallat, 2025) S06E08",
    "episode": "It's Just Papers, Right?"
  },
  {
    "id": 0,
    "name": "90 päivää morsiamena: Häiden jälkeen",
    "start": "2025-12-16T19:00:00Z",
    "channel": 12,
    "description": "Brandon ja Julia tekevät tärkeän elämänratkaisun Ronin ja Bettyn ​​kauhuksi, ja Matt ja Jasmine saavat tietää vauvansa sukupuolen. .(Yhdysvallat, 2024) S09E12",
    "episode": ""
  },
  {
    "id": 0,
    "name": "The Holzer Files",
    "start": "2025-12-16T17:00:00Z",
    "channel": 41,
    "description": "In California, the team investigate a dark and unsettling presence aboard the notorious Queen Mary. The spirit that confronted Hans in 1976 has supposedly risen again. S02E13",
    "episode": "Dead Calm"
  },
  {
    "id": 0,
    "name": "The Holzer Files",
    "start": "2025-12-16T18:00:00Z",
    "channel": 41,
    "description": "The team are in Massachusetts to investigate the Bates Ship Chandlery. Psychic medium Cindy Kaza reaches out to angry spirits that haunt the property. S02E01",
    "episode": "Devil In The Rock"
  },
  {
    "id": 0,
    "name": "Mysteries At The Castle",
    "start": "2025-12-16T19:00:00Z",
    "channel": 41,
    "description": "A sibling rivalry tears a family apart and inspires a beloved Christmas carol. A loyal butler uncovers a scandalous secret that sends him running for his life. S03E03",
    "episode": "Good King Wenceslas"
  },
  {
    "id": 0,
    "name": "Billy ja Molly: Saukollinen rakkautta",
    "start": "2025-12-16T17:00:00Z",
    "channel": 47,
    "description": "Jakso 1. Billy ja Molly: Saukollinen rakkautta. Kun kipeästi apua tarvitseva villisaukko huuhtoutuu laiturille syrjäisillä Shetlandinsaarilla Skotlannissa, Billy, hänen vaimonsa Susan ja heidän lammaskoiransa Jade saavat perheeseensä uuden ainutlaatuisen jäsenen. Billy & Molly on sydäntälämmittävä dokumentti rakkauden kyvystä herättää meidät taas näkemään luonnon kauneus. (Iso-Britannia, 2023)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Yukonin eläinlääkäri",
    "start": "2025-12-16T18:30:00Z",
    "channel": 47,
    "description": "Älä töki nukkuvaa piikkisikaa. .Nuorella porolla on useita vaivoja, joiden parantamiseen tarvitaan tri Oakleyn apua. Vanha piikkisika aiheuttaa pisteliään ongelman. (Yhdysvallat, 2021) S07E05",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Amsterdam Central 24/7",
    "start": "2025-12-16T19:00:00Z",
    "channel": 47,
    "description": "Amsterdamin päärautatieasemalla on kiireinen päivä, kun aseman työntekijät kohtaavat aggressiivisen henkilön, joka matkustaa ilman lippua, ja lisäksi he etsivät kolmea laitonta junamatkustajaa. Myöhemmin kaaos jatkuu, kun Orient Express saapuu asemalle, ja konserttimatkustajia täynnä oleva juna koettelee yövahdin hermoja. S01E03",
    "episode": "Junia, junia, junia"
  },
  {
    "id": 0,
    "name": "Australian kullankaivajat",
    "start": "2025-12-16T17:00:00Z",
    "channel": 82,
    "description": "Brent testaa edesmenneen ystävänsä Neville Perryn poikien kaivostaitoja. Mekaaninen rikko pysäyttää Wanderers-ryhmän kaivinkoneen. Mackies tekee riskaabelin investoinnin uuteen kohteeseen. Australian kullankaivajat eli kolme kovaa kullankaivajien ryhmää pistää koko elämänsä likoon etsiessään rikkauksia syvältä Länsi-Australian kesyttömiltä mailta. Australia, dokumenttisarja, 2024. S10E16",
    "episode": "1016"
  },
  {
    "id": 0,
    "name": "Australian kullankaivajat",
    "start": "2025-12-16T18:00:00Z",
    "channel": 82,
    "description": "Dust Devilsit investoivat 40 000 dollaria uuteen laitokseen. Feralsit meinaavat sulkea 50 asteen helteen takia. Marcus, Linden ja Dale saattavat lentää kohteestaan ulos vihaisen yhteenoton takia. Australian kullankaivajat eli kolme kovaa kullankaivajien ryhmää pistää koko elämänsä likoon etsiessään rikkauksia syvältä Länsi-Australian kesyttömiltä mailta. Australia, dokumenttisarja, 2020. S06E16",
    "episode": "616"
  },
  {
    "id": 0,
    "name": "Kartoittamaton Amazon ja Ash Dykes",
    "start": "2025-12-16T19:00:00Z",
    "channel": 82,
    "description": "Ash ja työryhmä etsivät Coppename-joen lähdettä. Alkulähteen sijainti on pysynyt mysteerinä, mutta koko tutkimusretken menestys riippuu nyt tästä ennenkuulumattomasta suorituksesta. Walesilainen tutkimusmatkailija Ash Dykes ja pieni ryhmä lentävät Surinamin syvään viidakkoon. Retken tarkoituksena on nostaa esiin viidakkoa uhkaavia tekijöitä. Singapore, dokumenttisarja, 2025. S01E01",
    "episode": "Alkulähdettä etsimässä"
  },
  {
    "id": 0,
    "name": "Toinen maailmansota: Vallan hinta",
    "start": "2025-12-16T17:50:00Z",
    "channel": 84,
    "description": "Liittoutuneet jatkavat etenemistä Normandiasta itäänpäin kohti Saksan rajaa. Itärintamalla Neuvostoliitto aloittaa sodan massiivisimman hyökkäyksen, Operaatio Bagrationin. Vuosisatojen ajan rakennettu maailma meni täysin uusiksi vain muutaman sotavuoden aikana. Perinteiset valtarakenteet kaatuivat ja uudet voimat nousivat luomaan modernia maailmaa. Britannia, dokumenttisarja, 2015. S01E11",
    "episode": "Helvetti irti"
  },
  {
    "id": 0,
    "name": "Toisen maailmansodan tärkeimmät tapahtumat väreissä",
    "start": "2025-12-16T18:55:00Z",
    "channel": 84,
    "description": "Hitlerillä oli häikäilemätön suunnitelma kääntää sodan suunta. Värikäsitelty arkistofilmi näyttää Saksan tykistön yhteistulitusta ja George Pattonin saapumisen Bastogneen Saksan piiritystä rikkomaan. Toisen maailmansodan kymmenen käännekohtaa näyttäytyvät nyt restauroituna ja värikäsiteltynä elokuvana. Vastaavaa toisen maailmansodan kuvausta ei ole nähty koskaan ennen. Britannia, dokumenttisarja, 2019. S01E07",
    "episode": "Taistelu Ardenneista"
  },
  {
    "id": 0,
    "name": "Adrianmeren salaisuudet",
    "start": "2025-12-16T20:00:00Z",
    "channel": 84,
    "description": "Adrianmeren altaan tutkimuksissa on paljastunut, että alueella asui muinaisia kansoja jo 30 000 vuotta ennen Kristusta. Britannia, 2025.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Challengers",
    "start": "2025-12-16T17:50:00Z",
    "channel": 33,
    "description": "Entinen tennispelaaja Tashi on tehnyt aviomiehestään Artista tenniskyvyn. Nyt Artin ura on laskussa, ja Tashi ilmoittaa hänet Challenger-turnaukseen, jossa Art kohtaa vastustajan, jonka he tuntevat. Amerikkalainen/italialainen draama vuodelta 2024.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Long Gone Heroes",
    "start": "2025-12-16T20:00:00Z",
    "channel": 33,
    "description": "Isänmaasta, uskosta ja jopa toivosta luopunut erikoisjoukkojen sotilas joutuu palaamaan taistelukentälle löytääkseen toimittajana toimivan sukulaistyttärensä keskeltä pahasti pieleen mennyttä operaatiota. Amerikkalainen toimintatrilleri vuodelta 2024.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "The Royal Hotel",
    "start": "2025-12-16T22:00:00Z",
    "channel": 33,
    "description": "Amerikkalaiset Hanna (Julia Garner) ja Liv (Jessica Henwick) ovat parhaat ystävykset, jotka ovat reppureissulla Australiassa. Kun rahat loppuvat kesken, seikkailunhaluinen Liv suostuttelee Hannan ottamaan majapaikan sisältävän osa-aikaisen työn “The Royal Hotel” -nimisen pubin baaritiskin takaa syrjäisestä kaivoskaupungista Australian takamailta. Australialainen trilleri vuodelta 2023.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Suuri puhallus 2",
    "start": "2025-12-16T16:50:00Z",
    "channel": 35,
    "description": "Kukistettuaan FBI:n vuotta aiemmin neljä hevosmiestä odottavat uutta tehtävää heidät värvänneeltä taikurien joukolta nimeltä Silmä. Kun J. Daniel Atlas alkaa etsiä joukkoa omin päin, hevosmiehet päätyvät teknologisen neron Walter Mabrynluo, joka antaa hevosmiehille tehtäväksi varastaa tietojenharavointilaitteen. Sitä seuraavat tapahtumat ja yllätykset vaikuttavat menneisiin, nykyisiin ja tuleviin hahmoihin. Amerikkalainen toiminta vuodelta 2016.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Hellboy",
    "start": "2025-12-16T19:00:00Z",
    "channel": 35,
    "description": "Natsien käsistä pelastettu paholainen vaihtaa puolta ja ryhtyy taistelemaan pimeyden voimia vastaan. Amerikkalainen toiminta vuodelta 2004.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "47 Meters Down: Uncaged",
    "start": "2025-12-16T21:10:00Z",
    "channel": 35,
    "description": "Neljä seikkailunhaluista teinityttöä lähtee tutkimaan muinaisen mayakaupungin raunioita 47 metriä merenpinnan alapuolella. Elämänsä seikkailuksi tarkoitettu retki muuttuu kuitenkin pian taisteluksi elämästä ja kuolemasta. Vedenalaiset rauniot ovat verenhimoisten valkohaiden metsästysalueita. Happipullojen tyhjentyessä kovaa vauhtia on heidän on löydettävä reitti ulos sokkeloisten raunioiden muodostamasta vedenalaisesta helvetistä. Amerikkalainen kauhu vuodelta 2017. (Iso-Britannia, 2019)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Karvinen",
    "start": "2025-12-16T18:00:00Z",
    "channel": 36,
    "description": "Karvinen (äänenä Chris Pratt), maailmankuulu, maanantaita vihaava, lasagnea rakastava sisäkissa kohtaa villin ulkoseikkailun! Jälleennäkemisen jälkeen kauan kadoksissa olevan isänsä – rähjäisen katukissa Vikin kanssa (äänenä Samuel L. Jackson) – Karvinen ja hänen koiraystävänsä Osku jättävät täydellisen hemmotellun elämänsä ja lähtevät Vikin mukaan hilpeään, korkeiden panosten ryöstökeikkaan. Amerikkalainen animaatioelokuva vuodelta 2024.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "The Cobbler",
    "start": "2025-12-16T20:00:00Z",
    "channel": 36,
    "description": "Max Simkin korjaa kenkiä pienessä newyorkilaisessa suutariliikkeessä, jonka hänen sukunsa on omistanut jo sukupolvien ajan. Arjen harmaus uhkaa käydä puuduttavaksi, kunnes eräänä päivänä kaikki muuttuu. Ompelukone tekee tenän ja Max kaivaa takahuoneesta esiin ikivanhan varakoneen. Yllättäen suutaritaituri huomaa ompelukoneella olevan taikavoimia, joiden ansiosta Max voi kirjaimellisesti hypätä asiakkaidensa kenkiin ja nähdä maailman uusin silmin. Amerikkalainen komedia vuodelta 2014.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Polttarittaret",
    "start": "2025-12-16T22:00:00Z",
    "channel": 36,
    "description": "Becky (Rebel Wilson) pyytää morsiusneidoikseen kolme ystäväänsä, jotka pitivät häntä high schoolissa pilkkanaan. Todellisuus kirvelee pinnan alla super-kaaso Regania (Kirsten Dunst) koska hän kun ei olekaan porukan ensimmäinen, joka astelee vihille. Teräväpäinen ja siveetön Gena (Lizzy Caplan) on kaappiromantikko, ja hupakko Katie (Isla Fisher) taas rakastaa makeaa elämää. Vallattomat morsiusneidot haluavatkin pitää polttareissa hiukkasen hauskaa - myös Beckyn kustannuksella - ja saavat lopulta paljon enemmän kuin toivoivat. Hääpukukatastrofin, entisten poikaystävien ja muiden öisten töppäilyiden jälkeen nousevan päivän valossa ovat koetuksella niin ystävyys kuin morsiamen onnikin. Ovatko näiden morsiusneitojen kanssa häät pelkkää painajaismaista krapulaa? Amerikkalainen komedia vuodelta 2012.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "A Christmas Stray",
    "start": "2025-12-16T17:15:00Z",
    "channel": 114,
    "description": "Kun kulkukoira ajaa Ethanin auton tieltä, hän jää jumiin kylään. Ethan on raivoissaan, kun hän kuulee jääneensä jouluksi jumiin lumen takia – kunnes hän tapaa kauniin paikallisen eläinlääkärin. Amerikkalainen draama vuodelta 2021.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "A Merry Royal Christmas",
    "start": "2025-12-16T19:00:00Z",
    "channel": 114,
    "description": "Felicity on kiireinen hääsuunnittelija, joka palkataan viime hetkellä prinsessa Julietten jouluhäihin Knightonissa. Brittiläinen jouluelokuva vuodelta 2024.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Christmas Unfiltered",
    "start": "2025-12-16T20:45:00Z",
    "channel": 114,
    "description": "Jouluaattona Becky toivoo, että hänen perheensä todella kuuntelisi häntä. Kaikki hänen turhautumisensa alkavat purkautua, kun hän alkaa tahattomasti kertoa kaikille, mitä oikeasti ajattelee. Amerikkalainen dokumentti vuodelta 2022.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Prinssille morsian",
    "start": "2025-12-16T17:05:00Z",
    "channel": 57,
    "description": "Eddie Murphy ja Arsenio Hall irrottelevat olan takaa romanttisessa komediassa, jossa Murphy esittää keksityn afrikkalaisen kunningaskunnan prinssiä, joka matkustaa New Yorkiin etsimään morsianta itselleen. Morsian kyllä löytyy, ja Amerikka tuottaa prinssille ja hänen ystävälleen monenlaisia yllätyksiä... Pääosissa: Eddie Murphy, Arsenio Hall, James Earl Jones, Shari Headley, Madge Sinclair. Ohjaus: John Landis. (Coming to America, Yhdysvallat, 1988)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Reservoir Dogs",
    "start": "2025-12-16T19:00:00Z",
    "channel": 57,
    "description": "Quentin Tarantinon kulttisuosion saavuttanut esikoisohjaus ja käsikirjoitus epäonnistuneesta timanttiryöstöstä. Pääosissa Harvey Keitel, Steve Buscemi, Tim Roth ja Michael Madsen. 1992 USA. Pääosissa: Tim Roth, Harvey Keitel, Michael Madsen, Steve Buscemi, Chris Penn. Ohjaus: Quentin Tarantino.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Riivattu",
    "start": "2025-12-16T20:35:00Z",
    "channel": 57,
    "description": "Perheelle sattuu sarja pelottavia tapahtumia. Kun heidän poikansa vaipuu pitkäaikaiseen, outoon koomaan, perhe epäilee, että heidän talossaan kummittelee. Heidän täytyy kartoittaa niin paranormaaleja ilmiöitä kuin menneisyyttäkin yrittäessään herättää poika unesta. Rooleissa nähdään Patrick Wilson (Watchmen), Rose Byrne (28 viikkoa myöhemmin), Ty Simpkins ja Lin Shaye. Pääosissa: Patrick Wilson, Rose Byrne, Ty Simpkins, Lin Shaye, Leigh Whannell. Ohjaus: James Wan. (Insidious, Yhdysvallat, 2010)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Aallonmurtaja",
    "start": "2025-12-16T17:30:00Z",
    "channel": 17,
    "description": "Tuula uhraa paljon saadakseen oikeutta. Jengien välit ovat veitsenterällä ja 77:n Jokke pilkkaa Upia. Järvinen saa tilaisuutensa. Nuppu lähentyy Lukea ja Inari löytää vaarallisen kätkön. S03E03",
    "episode": "Vaarallinen vieras"
  },
  {
    "id": 0,
    "name": "Kämppikset",
    "start": "2025-12-16T18:15:00Z",
    "channel": 17,
    "description": "Lääketieteen ja rakkauden parantama. .Jessen kutsumus hoitoalalle herää, Pilvin muistolaatikko saa hänet haaveilemaan matkasta kaukomaille, Raimo palaa kotiin ja tonttu saa vihdoin nimen. Hulvattomassa MTV-alkuperäissarjassa seitsemänkymppiset seniorit ja teini-ikäiset juniorit muuttavat kimppakämppään ja elävät yhdessä kuin viimeistä päivää. S02E10",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Kunnes kuolema meidät erottaa",
    "start": "2025-12-16T19:00:00Z",
    "channel": 17,
    "description": "Sarja alkaa.  Väljähtäneen avioliittonsa ja vauva-arjen uuvuttama Beta odottaa lapselleen päiväkotipaikkaa palatakseen töihin. Hän hyväksyy pitkin hampain äitinsä tarjouksen ja palkkaa parikymppisen Atlin lapsenhoitajaksi. S01E01",
    "episode": "Otsasuudelmia ja piiskaa"
  },
  {
    "id": 0,
    "name": "REV Lada: Built by Pride—or by Prisoners?",
    "start": "2025-12-16T17:30:00Z",
    "channel": 29,
    "description": "The Lada, once a symbol of rugged simplicity, now struggles to balance nostalgia, necessity and rapid change. Since Russia’s war in Ukraine, Lada faces a harsh reality as sanctions and shortages reshape its future.",
    "episode": ""
  },
  {
    "id": 0,
    "name": "DW News",
    "start": "2025-12-16T18:00:00Z",
    "channel": 29,
    "description": "DW News goes deep beneath the surface, providing the key stories from Europe and around the world. Exciting reports and interviews from the worlds of politics, business, sports, culture and social media are presented by our DW anchors in 15-, 30- and 60-minute shows. (2025)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Eco Africa The Environment Magazine",
    "start": "2025-12-16T18:30:00Z",
    "channel": 29,
    "description": "On this edition, we see how volunteers are saving native plants in South Africa, solar lamps are improving education in Rwanda and visit the band making music with garbage in DR Congo. Deutsche Welle's Eco Africa showcases innovative concepts and best practice projects from Africa and Europe and presents environment and climate change ideas that inspire others to get on board or start something of their own. Eco Africa offers insight and moves people to help protect the environment. (2025)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Hartz und herzlich - Tag für Tag Rostock",
    "start": "2025-12-16T17:05:00Z",
    "channel": 131,
    "description": "Jasmin und Maik bereiten sich auf Weihnachten vor und haben viele Lebensmittel eingekauft, um über die Feiertage zu kommen. .Nun fragen sie sich, ob alles in ihre Vorratsschränke passt. Thema der Sendung sind Menschen, die Sozialleistungen beziehen, wenig Geld zur Verfügung haben, beziehungsweise in gewissen sozialen Brennpunkten leben. Die Sozialdokumentation aus Deutschland geht auf verschiedene Problemfelder dieser Menschen ein. (2025) S12E38",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Berlin - Tag & Nacht",
    "start": "2025-12-16T18:05:00Z",
    "channel": 131,
    "description": "Milla fühlt sich in der neuen WG überhaupt nicht willkommen. .Schon beim Frühstück wurde sie übergangen, und jedes Mal, wenn sie versucht, ein Gespräch anzufangen, wird sie ignoriert. Als Janni dann auch noch unangekündigt in ihrem Zimmer steht, empfindet Milla das als übergriffig und merkwürdig. Frustriert wendet sie sich an Emmi und lässt ihrem Ärger freien Lauf ? ohne zu merken, dass Janni zufällig jedes Wort mithört. Berlin – Tag & Nacht (Akronym: „BTN“ oder „BerlinTN“) ist eine deutsche Reality-Seifenoper des Fernsehsenders RTL II. Die Sendung zeigt an verschiedenen Orten Berlins wohnende Personen im Teenager- bis Erwachsenenalter, die sich mit ihren alltäglichen Problemen auseinandersetzen. (2025) S15E3587",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Armes Deutschland - Stempeln oder abrackern?",
    "start": "2025-12-16T19:15:00Z",
    "channel": 131,
    "description": "Carola feiert Geburtstag und trifft sich abends mit Chris und seinen Freunden. .Doch die Stimmung kippt, als Chris' eifersüchtige Freundin Sabrina auftaucht. Auch bei Steven droht Ärger: Gegen ihn läuft ein Gerichtsverfahren, denn er soll falsche Vaterschaften anerkannt und dafür Geld bezogen haben. Felicitas wartet verzweifelt auf einen Klinikplatz für ihren Sohn Lenny, aber der rettende Anruf der Klinik lässt weiter auf sich warten. Lohnt sich Arbeit in Deutschland? Auf der Suche nach Antworten begleitet die RTLZWEI-Dokumentation \"Armes Deutschland\" Menschen in unterschiedlichsten Lebenssituationen - mit einer gewichtigen Gemeinsamkeit: Sie sind von Sozialleistungen abhängig oder stehen kurz davor. (2024) S10E19",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Inside Story",
    "start": "2025-12-16T17:30:00Z",
    "channel": 107,
    "description": "Jakso 1181. Beyond the headlines to the heart of the news of the day. Al Jazeera gets the Inside Story from some of the best minds from around the globe. Beyond the headlines to the heart of the news of the day. Al Jazeera gets the Inside Story from some of the best minds in the Middle East and beyond. (2025)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "Newshour",
    "start": "2025-12-16T18:00:00Z",
    "channel": 107,
    "description": "Up-to-date news and analysis from around the world. (2025)",
    "episode": ""
  },
  {
    "id": 0,
    "name": "News Live",
    "start": "2025-12-16T19:00:00Z",
    "channel": 107,
    "description": "Up-to-date news and analysis from around the world. (2025)",
    "episode": ""
  }
]